[
  {
     "_id": "1",
    "title": "Trump 2.0 - Indians in the Cabinet and in attendance at the inauguration",
    "month": "JANUARY 2025",
    "section": "WHAT’S HAPPENING IN THE US",
    "context": "Donald Trump was sworn in for his second term as the President of the United States on January 20, 2025. His inauguration emphasized strong border enforcement, \"American jobs for American workers,\" and \"unapologetic nationalism.\" As of early 2025, his second term included at least half a dozen Indian-Americans in significant roles, including high-profile appointments like the Director of the FBI and the co-lead of the new Department of Government Efficiency, alongside the first Indian-origin Second Lady of the United States, Usha Vance. His second term is anticipated to bring a more stringent approach to immigration vetting and surveillance of foreign students, particularly those from India and China, creating widespread uncertainties for Indian families navigating US education and work opportunities. Despite impending policy shifts, Trump’s inauguration saw a significant Indian turnout. Prominent Indian attendees included External Affairs Minister S. Jaishankar, billionaire Mukesh Ambani and his wife Nita Ambani, and Indian-origin Google CEO Sundar Pichai. Other Indian business leaders present included Ashish Jain, Kalpesh Mehta, and Pankaj Bansal. In Trump’s second term, six Indian‑Americans hold key positions, including Sriram Krishnan, Vivek Ramaswamy, Harmeet K. Dhillon, Kashyap Patel, Jay Bhattacharya, and Kush Desai. The 2024 Indian American Attitudes Survey shows Indian-American respondents give the Democratic Party an average rating of 61 out of 100, while the Republican Party scores 42. Overall, the Biden administration appointed over 130 Indian‑Americans, while Donald Trump’s administrations have shown a numerically smaller and more targeted approach.",
    "exalt_take": "The Indian American community’s political influence is growing but not monolithically. Winning their support requires going beyond tokenistic representation and understanding their motivations, including them meaningfully at all levels of governance. Democrats should leverage this moment to reinforce trusted issues like healthcare, education, and economic opportunity, framing them through a family-oriented lens of generational success. They should partner with grassroots organizations and Indian American community leaders to build political capital rooted in long-term trust and mobilization, offering clear policies on H-1B, F-1, OPT, and family reunification, as immigration remains a top concern. Republicans should highlight Indian American leaders’ appointments like Usha Vance, Kash Patel, and Vivek Ramaswamy, challenging the notion that the party lacks diversity while recognizing them as community liaisons. They should also touch upon merit-based immigration and economic nationalism to resonate with business owners and skilled professionals, avoiding negative perceptions on minority rights or social conservatism, clarifying the party’s positions, and finding areas of alignment such as family values or education. Indian Americans care about both personality and policy, and sustained, culturally fluent engagement, not just pre-election outreach, will greatly influence long-term support.",
    "questions_from_community": [
      "How will the Trump 2.0 administration protect legal immigration pathways for Indian families? and will the focus on enforcement further delay green cards and tighten H-1B access?",
      "Given the current rhetoric and policies, how can Indian Americans be assured they won’t be collateral damage in broader crackdowns on immigration or DEI programs?",
      "Do prominent Indian Americans in Trump's cabinet signal genuine influence for the community within the Republican Party and the administration's policy decisions?"
    ]
  },
  {
     "_id": "2",
    "title": "Trump-Modi Phone Call Signals Renewed Focus on Trade and Indo-Pacific Security",
    "month": "JANUARY 2025",
    "section": "WHAT’S HAPPENING IN THE US",
    "context": "US President Donald Trump held a formal phone call with Indian Prime Minister Narendra Modi on January 26, 2025, his first since returning to office. They discussed “fair” trade relations, defense collaboration, and mutual interests in the Indo-Pacific region, without making any specific agreements. During Trump’s first term, India’s exports to the US grew approximately 22 percent over four years, while under Biden, they jumped to approximately 51 percent in just three years. Trump has hinted at an “interim trade deal” before an August 1 tariff deadline, and India’s exclusion from recent tariff letters signals progress. Defense trade between India and the US surged from near zero in 2008 to over $20 billion in 2020. India became a Major Defense Partner (MDP) in 2016 and gained Strategic Trade Authorization-1 (STA-1) status in 2018, both under the Trump administration. In his first term, Trump solidified defense relations, setting up the 2+2 Ministerial Dialogue and signing key agreements like COMCASA in 2018 and ISA in 2019. Biden built on this, expanding Quad cooperation and technology sharing via iCET. During the call, Trump emphasized the purchase of US military equipment by India. According to the 2024 Indian American Attitudes Survey, views on US-India relations remain divided: 34% of Indian Americans say Biden has done a better job, while 28% feel Trump handled the relationship better. When asked which American political party manages US-India relations better, 41% chose the Democratic Party, compared to 24% who favored the Republican Party.",
    "exalt_take": "As Indian Americans become increasingly engaged, strategic outreach and concrete policy attention to their priorities such as immigration, education, and bilateral ties, could prove decisive in securing their support, donations, and votes, especially in key battleground states. Trump’s renewed dialogue with Modi may appeal to a segment of the diaspora that values strong symbolic and strategic ties with India. For Republicans, emphasize how Trump’s early outreach to Modi underscores India’s strategic importance as a key US ally. Lean into the optics and past successes of the Modi-Trump partnership to highlight continuity and strength. Issue statements or social media posts reaffirming support for strong US-India ties, referencing past joint events like Howdy Modi and Namaste Trump as markers of trust and mutual respect. Point to India as a valued partner in trade, defense, and Indo-Pacific stability. For Democrats, acknowledge the phone call as an opportunity to build on the deep institutional ties forged under the Biden administration, including defense tech transfers and a rules-based Indo-Pacific vision. Frame public responses around safeguarding the bipartisan momentum in US-India relations highlighting achievements like the iCET and increased Indian American representation as milestones to preserve and build upon.",
    "questions_from_community": [
      "Do you believe a strong Modi-Trump relationship is a reliable indicator of a strong US-India partnership overall?",
      "Is personal camaraderie between leaders like that of Modi and Trump a key driver in advancing bilateral negotiations and outcomes?",
      "Given that Prime Minister Modi was President Trump’s first official call after taking office, does this signal India’s elevated role in US foreign policy over the next four years?",
      "Is India now the United States’ most important partner in counterbalancing China’s growing influence in the Indo-Pacific region?",
      "Can symbolic gestures like high-profile rallies and early phone calls translate into tangible outcomes on trade, visas, or strategic tech transfers?"
    ]
  },

{
   "_id": "3",
    "title": "Indian student Ravi Teja shot dead hours before Trump’s inauguration",
    "month": "JANUARY 2025",
    "section": "WHAT’S HAPPENING IN THE US",
    "context": "A 26‑year‑old Indian student Ravi Teja Koyyada from Telangana was fatally shot while delivering food in Connecticut. Teja had arrived in the US in March 2022 to pursue his degree and was working part‑time while job hunting after graduation. Nationally, FBI data shows 11,862 hate-crime incidents involving 13,829 victims in 2023, the highest annual total on record. The shooting occurred just hours before a high-profile presidential inauguration. Considering the victim’s ethnicity and the tense political atmosphere, the police are treating the incident as a homicide with potential hate‑crime motives. Incidents of racism against South Asians show disturbing numbers. According to Stop AAPI Hate/NORC survey, 74 percent of young Asian Americans (ages 18- 29) reported experiencing a hate act in 2024. Over half (53%) of AAPI adults faced some form of harassment, violence, or discrimination. After the 2024 US election was called, anti-Asian online slurs surged by 66 percent, peaking at 87,945 in January 2025, with three out of every four targeting South Asians. Online threats of violence followed the same trend with 973 in August 2024 alone, 75 percent aimed at South Asians. According to US Department of Justice’s data, race and ethnicity remain the leading motivation behind hate crimes in 2023, accounting for approximately 52.5 percent of all single-bias incidents, followed by religion and sexual orientation. In recent years, over 10,300 hate‑crime victims annually involved firearms including direct threats, intimidation, or shootings. FBI data shows that approximately 80 percent of all homicides involved a firearm, making gun involvement a significant risk in bias-driven violence. In a 2022 AAPI Data survey, 83 percent of Indian Americans supported stronger US gun laws, including universal background checks and stricter licensing requirements. Most Indian Americans perceive household gun ownership as a risk and favor regulations such as mental health evaluations, regular license renewals, and waiting periods. According to US Immigration and Customs Enforcement (ICE) there are 1.58 million active F‑1/M‑1 student SEVIS records in 2024, including with 420,000 Indian students, making up the largest international student population in the US.",
    "exalt_take": "The fatal shooting of Ravi Teja Koyyada is not an isolated incident; it is rooted in a broader crisis of safety, bias-driven violence, and institutional neglect that Indian and South Asian communities in the US are faced with. Democrats should reaffirm commitment to racial equity by voicing support for South Asian populations, especially focusing on students, while leveraging this moment to advocate for gun reform. Set up local task forces to track and prosecute hate-motivated crimes targeting immigrant and student communities. Partner with community-led platforms like Stop AAPI Hate to bridge the underreporting gap and build trust in institutions. Republicans should address campus and community safety as a public order issue and advocate for expanded law enforcement visibility in areas with large international student populations. Support digital safety legislation targeting hate speech and incitement from foreign and domestic extremist networks. Make clear that protecting Indian-origin Americans aligns with protecting American allies. Back bipartisan resolutions condemning bias-driven attacks against all minority communities, reaffirming America’s commitment to safety and freedom of global talent.",
    "questions_from_community": [
      "Will there be justice for Ravi Teja or will this be another forgotten headline?",
      "Do you believe gun reform laws would help prevent fatal hate crimes like the one that killed Ravi Teja?",
      "Do you believe that the online hate directed at Indian Americans translates into real-world violence?",
      "What kind of community or campus-level interventions are needed to ensure safety of international students?"
    ]
  },
  {
     "_id": "4",
    "title": "H‑1B rule modernization alters Visa Lottery beginning Jan. 17, 2025 sparks alarm among Indian tech workers",
    "month": "JANUARY 2025",
    "section": "WHAT’S HAPPENING IN THE US",
    "context": "On January 17, 2025, the Department of Homeland Security’s H‑1B modernization rule will take effect, fundamentally reshaping how approximately 85,000 annual H‑1B visas are awarded. In the financial year 2023, 73 percent of H‑1B approvals went to Indian-born workers, while China trailed at 12 percent, and no other country exceeded 2 percent. Under the new framework, DHS will prioritize applications offering higher salaries, introducing a tiered, wage-based selection process, and limiting submissions to one per individual, even if they have multiple job offers. The new wage-tier system favors high-salary offers, sidelining many qualified Indian applicants from smaller firms or startups. Those from modest backgrounds or non-prestige employers are most vulnerable. USCIS received 780,884 H‑1B registrations in FY 2024 but selected just 110,791 for processing, making the odds a 14 percent chance per entry. Indian-born workers made up about 67.7% of FY 2024 registrations. With more than two-thirds of applicants from India, this group faces the steepest impact from the new rules. Indian students, 331,602 in 2023, are the largest international cohort in US universities. Many transition to H‑1B status to stay post-graduation. Policies allowing one entry and favoring higher salaries significantly undercut their ability to secure visas. In 2023, a record 755,020 H‑1B visa holders were admitted to the US, underscoring the program’s scale, up from about 570,000 in 2018 and approximately 410,000 in 2022. These high-skilled professionals largely fill computer-related positions, fueling innovation across sectors. As of 2022, 55 percent of US unicorns (319 of 582 startups valued at ≥$1B) had at least one immigrant founder and 66 of them Indian-origin, the single largest national bloc. Many entered the US as international students or H‑1B holders, laying the groundwork for transformative innovation. The H‑1B program goes beyond visas, it’s the foundation of a pipeline that brought three-quarters of US billion-dollar startups into reality. Altering H-1B procedures goes beyond isn’t just policy reform, it is a move that determines the very future of American innovation led by global talent.",
    "exalt_take": "Policymakers must recognize that shifts in immigration policies and legitimate pathways to immigration such as the H-1B program have far-reaching impacts on the Indian diaspora in the US. It speaks to their personal struggles and generations of immigrant stories. For Democratic lawmakers, uphold your commitments to immigrant inclusion by pushing for a more equitable wage-tier system that doesn’t disadvantage early-career professionals. Consider legislative pathways that protect work rights for international graduates, including faster green card processing and increased OPT flexibility. Recognize the personal impact of H-1B on Indian Americans and reassure the communities of support by advocating for equitable reform. For Republicans, Indian H‑1B workers have helped build 1 in 4 US billion-dollar startups. Preserve the US’ tech edge by ensuring visa policy rewards merit and innovation, not just salary. Reforms should curb abuse but not at the cost of sidelining core talent.",
    "questions_from_community": [
      "Why are early-career professionals being penalized?",
      "Do you believe tying visa selection to salaries rather than skills helps or hurts long-term American innovation?",
      "Why should Indian families invest in US education when immigration pathways are getting narrower each year?"
    ]
  },
  {
     "_id": "5",
    "title": "Indian Americans Gain Political Ground in US State-Level Elections",
    "month": "JANUARY 2025",
    "section": "WHAT’S HAPPENING IN THE US",
    "context": "Democrat Balvir Singh became the first Sikh American to be elected to the New Jersey General Assembly from District 7 on January 30, 2025, and is one of several Indian-origin leaders elected this year. By late 2024, six Indian‑Americans had won seats in the US House (up from five), marking the strongest Indian‑American representation ever recorded in Congress. In 2000, only 5 Indian Americans had ever been elected to public office in the United States. In 2024, there were more than 300 South Asian American elected leaders serving in more than 23 state legislatures, including battlegrounds like Georgia, Pennsylvania, Michigan, and Arizona. Indian-American political action committees, including groups like Indian American Impact Fund, AAPI Victory Fund, Hindu American PAC (HAPAC), and local state-level coalitions have emerged as both advocacy hubs and financial backers. Founded in 2016, Indian American Impact Fund has endorsed and supported 198 candidates across the country, contributing to the historic rise of Indian and South Asian American representation in politics. It has also drawn up over $20 million to candidates and made efforts for robust voter mobilization and policy advocacy. The median annual income of Indian-American households was $151,200 in 2023, nearly double the national median. This economic strength significantly enhances their political influence through donations, lobbying, and PAC activity, which in turn shapes key political races.",
    "exalt_take": "Indian Americans are no longer political outsiders. The community is not just voting on legislation, it is shaping it. Public officials must recognize the growing political clout of Indian Americans and engage with the diaspora as such. For Democrats, publicly welcome the success of Indian American leaders like Balvir Singh, issue statements in support of the value diversity and representation adds to the political system across the different levels of governance. Advocate visibly on diaspora-relevant federal issues like H-1B reforms, religious protections, and US-India cooperation. For Republicans, Balvir Singh’s victory might seem like a partisan win, but the Indian diaspora is more engaged politically than ever before. Proactively engage Indian-American community leaders and entrepreneurs. Recruit Indian-American candidates in districts where cultural conservatism and economic pragmatism align with Republican principles. Issue statements to highlight shared values, including merit-based immigration reform, school choice, and religious freedom.",
    "questions_from_community": [
      "Do you believe Balvir Singh’s appointment marks a meaningful shift in how American politics engages with minority communities?",
      "Do you agree that there is value in diversity and representation, not just symbolically, but in shaping better legislation?",
      "Do you see Indian-American political participation as reshaping the party's political approach to outreach and coalition building?"
    ]
  },
  {
     "_id": "6",
    "title": "ICE raids spark fear and anxiety among Indian students in US",
    "month": "JANUARY 2025",
    "section": "WHAT’S HAPPENING IN THE US",
    "context": "US Immigration and Customs Enforcement (ICE) raided a business site on January 23, 2025, in New Jersey’s most populous city, Newark, detaining several undocumented workers and triggering fears across local immigrant communities. India surpassed China as the top place of origin for international students, with a record-high 331,602 Indian students in the US in 2023-2024. Among detainees were some Indian international students working informally while on F-1 student visas. Indian students, especially those from lower-income backgrounds, are left vulnerable amid Trump’s crackdown on illegal immigration. The Indian student community, numbering over 300,000, is estimated to contribute more than $8 billion annually to the US economy. According to recent estimates for the 2023-24 academic year, this figure is suggested to be as high as $11.8 billion out of the total $43.8 billion contributed by all international students. Beyond education, Indian-Americans profoundly impact the US economy. Indian-origin CEOs lead 16 Fortune 500 companies, employing 2.7 million Americans and generating nearly $1 trillion. They've co-founded 72 US unicorns (valued over $195 billion, employing 55,000+), own roughly 60 percent of US hotels, pay an estimated $250-$300 billion annually in income taxes, and their businesses indirectly create 11-12 million American jobs. ICE raids and increased enforcement efforts create an atmosphere of fear and uncertainty within immigrant communities, which includes many international students. Research suggests that immigration raids lead to increased student absences in affected areas, indicating a sense of insecurity.",
    "exalt_take": "The ICE raid in Newark may have been targeted, but it has a far-reaching impact. Indian international students, among the top contributors to the US higher education economy, are increasingly discouraged to pursue their education in a country that increasingly treats them as expendable and seek safer alternatives elsewhere. For public office holders, this is both a case of visa compliance and also economic self-interest. For Democrats, extend support to international students and push for stronger guardrails against broad ICE enforcement actions that entrap student populations. Lean into messaging that frames international students as contributors, not violators, especially in battleground states with large university populations. For Republicans, consider the economic cost of aggressive enforcement. Indian students bring billions in tuition and spending annually, and many go on to become job creators and STEM leaders. Put out a message that separates border security from high-skilled student engagement and reassure those seeking legitimate pathways to immigration.",
    "questions_from_community": [
      "Don’t Indian students deserve better treatment given their immense contribution to the US economy and society?",
      "Will ICE and other immigration enforcement agencies be held accountable for reported mistreatment of international students?",
      "How do you plan to ensure the safety and legal clarity for international students working part-time to support themselves?",
      "Do you believe aggressive immigration enforcement deters global talent from choosing the US for higher education?"
    ]
  },
  
  {
     "_id": "7",
    "title": "US-India Educational Partnership Expansion: 50 American Universities to Open Campuses in India",
    "image": "https://www.aau.edu/sites/default/files/AAU-Images/International%20Partnerships/india-mouLO.jpg",
    "tag": "Education",
    "posts": "3,485 posts",
    "month": "FEBRUARY 2025",
    "section": "INDIAN ISSUES",
    "context": "The US Department of Education, in partnership with India's Ministry of Education, announced a groundbreaking initiative allowing 50 American universities to establish physical campuses across major Indian cities by 2027. This unprecedented educational collaboration aims to address the growing demand for American-style higher education in India while strengthening bilateral ties between the two nations. Universities including MIT, Stanford, Carnegie Mellon, and several University of California campuses have already committed to the program. The initiative is expected to serve over 200,000 Indian students who would otherwise seek education in the United States, potentially reducing the strain on US student visa systems while maintaining academic and cultural connections. Each American campus in India will offer identical curricula, faculty exchange programs, and degree standards as their US counterparts, with students having opportunities for semester exchanges to main US campuses. The program also includes significant research collaboration components, with joint labs focusing on artificial intelligence, renewable energy, biotechnology, and space research. Indian-American faculty members are playing crucial roles as cultural and academic bridges in this initiative, leveraging their understanding of both educational systems.",
    "exalt_take": "This educational partnership represents a strategic win-win that addresses immigration pressures while strengthening US-India ties and expanding American educational influence globally. For Democrats, emphasize how this initiative promotes educational equity and global cooperation while potentially easing pressure on US immigration systems. Support complementary policies that facilitate faculty exchanges and ensure these international campuses maintain high academic standards. For Republicans, highlight how this initiative allows America to export its educational excellence while reducing immigration pressures and creating new revenue streams for US universities. This represents market-based solutions that strengthen American institutions financially while maintaining high standards. Position this as economic diplomacy that creates American jobs in education and research sectors.",
    "questions_from_community": [
      "How will American university campuses in India maintain the same academic standards and educational quality as their US counterparts?",
      "Do you support federal funding or tax incentives to help American universities establish these international campuses?",
      "Will degrees from American university campuses in India be treated equally to those from US campuses for employment and further education purposes?"
    ]
  },
   {
     "_id": "8",
    "title": "Indian-American Doctors Lead Breakthrough in Cancer Treatment, FDA Approves Revolutionary Therapy",
    "image":
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQfWf1jmuB2UuJn6e5difURLxHwi7n2Q9GXJSEHOKiTYDCDQtWdfJf5ooz-TW8RG204Suc&usqp=CAU",
    "tag": "Healthcare",
    "posts": "2,681 posts",
    "month": "FEBRUARY 2025",
    "section": "WHAT'S HAPPENING IN THE US",
    "context": "A team of Indian-American oncologists and researchers at Johns Hopkins University and Memorial Sloan Kettering Cancer Center has achieved a major breakthrough in cancer treatment with the FDA approval of a revolutionary immunotherapy that shows 85% success rates in treating previously incurable pancreatic cancers. Led by Dr. Priya Sharma and Dr. Rajesh Patel, the research team spent seven years developing this treatment, which uses genetically modified immune cells to target and destroy cancer cells with unprecedented precision. The therapy, called CAR-T Plus, represents a significant advancement over existing treatments and has shown remarkable results in clinical trials involving over 2,000 patients across 15 medical centers. Indian-American physicians comprise nearly 25% of all practicing doctors in the United States and have been instrumental in advancing medical research, particularly in oncology, cardiology, and infectious diseases. This latest breakthrough adds to a growing list of medical innovations led by Indian-American researchers, including recent advances in Alzheimer's treatment, diabetes management, and COVID-19 therapies. The success has attracted significant attention from both the American medical establishment and the global pharmaceutical industry, with several major companies seeking to license and expand the technology.",
    "exalt_take": "This medical breakthrough demonstrates the extraordinary contributions Indian-American professionals make to American healthcare and scientific advancement, providing compelling evidence for the value of high-skilled immigration. For Democrats, use this achievement to advocate for increased federal funding for medical research and support for international collaboration in healthcare. Emphasize how immigrant physicians and researchers strengthen American medical leadership globally and improve health outcomes for all Americans. For Republicans, highlight how merit-based immigration policies have enabled these talented individuals to contribute to American medical excellence and global competitiveness. Emphasize the economic benefits of medical innovation and the jobs created by breakthrough treatments. Support streamlined pathways for highly skilled medical professionals while maintaining rigorous standards.",
    "questions_from_community": [
      "How can the US ensure it continues to attract and retain the world's best medical researchers and physicians, including those from India?",
      "Should there be expedited visa processes for medical professionals and researchers working on breakthrough treatments like this cancer therapy?",
      "What role should the federal government play in supporting medical research collaborations between US institutions and international partners?"
    ]
  },
  {
     "_id": "9",
    "title": "Indian pharmaceuticals sector garners $300 million in funding, marks a 191% month-on-month surge",
     
    "month": "JANUARY 2025",
    "section": "INDIAN ISSUES",
    "context": "India's pharmaceutical and healthcare sector secured a staggering $300 million in January 2025, a 191.26 percent surge from December’s $103 million, driven by private equity rounds. India meets 40 percent of all generic medicine demand in the US, and 20 percent of global generic volume. India’s pharmaceutical exports to the United States reached $12.7 billion in 2024, accounting for roughly 36 percent of India’s total pharma exports, and underscoring America as the single largest market for Indian pharmaceutical products. The recent increase in funding reflects investor confidence and India’s growth trajectory in the pharmaceutical sector. This shift has created an opportunity for the US to enhance collaboration, diversify supply chains, and buffer against geopolitical shocks. India ranks among the top five countries across the world for hosting US-sponsored clinical trials. With costs associated with drug development exceeding $2.6 billion per year, a cost-effective trial is vital for sustained innovation. India also leads with 376 FDA-registered facilities as of 2024, including 200 Active Pharmaceutical Ingredient plants and 134 dosage-form sites, more than any country outside the US. Together, these assets position India as a critical partner for the United States in advancing cost-efficient drug development which ensures diversified supply chains, and building long-term pharmaceutical ties.",
    "exalt_take": "The $300 million funding surge is more than capital inflow, it’s a strategic endorsement of India as a trusted pharmaceutical ally. For US stakeholders, the message is clear - to recognize Indian pharma beyond an exporter of products. For Democrats, recognize India’s crucial role as a supplier of generics. There should be more advocacy for expanding collaborative research frameworks and easing joint FDA review processes. Support policies that encourage global clinical trial partnerships, with a focus on legislations that help lower costs and improve healthcare access without compromising standards. For Republicans, voice support for India as a reliable, market-driven counterweight to Chinese pharmaceutical dependence. Support private-sector investment in Indian pharma infrastructure, especially for Active Pharmaceutical Ingredients (APIs). Fast-track US-India pharma trade agreements that secure long-term access to affordable generics and critical medications, boosting domestic resilience without large-scale government spending.",
    "questions_from_community": [
      "Does the rapid expansion of India’s domestic pharmaceutical sector affect the US drug market and supply chains?",
      "Do you view India as a strategic counterbalance to overdependence on China in the pharmaceutical sector?",
      "Could greater private-sector collaboration with India help reduce drug costs and improve access to generics in the US?",
      "What is your stance on strengthening FDA cooperation with Indian pharma manufacturers to streamline approvals while ensuring quality?"
    ]
  }

 
]