
{
  "2025": {
    "january": {
      "exalt_summary": "This brief covers major developments that impacted the Indian diaspora and US-India relations in January 2025. In this edition, we begin by looking at Trump's second inauguration, including the significant presence of prominent Indian attendees and the appointment of six Indian-Americans to key administration roles. We also cover the political polarization within the Indian-American community, as evidenced by the 2024 Indian American Attitudes Survey, which showed a preference for Democrats over Republicans. The brief also analyzes the first phone call between President Trump and Prime Minister Modi since Trump's return to office, examining its implications for trade, defense, and security cooperation. We highlight India’s growing role as a US ally and defense partner, and the bipartisan support for a strong US-India relationship. Additionally, this issue addresses the tragic shooting of Indian student Ravi Teja Koyyada in Connecticut, positioning it within a broader context of rising anti-South Asian hate crimes and gun violence in the US. The brief further discusses the new H-1B modernization rule, which introduces a tiered, wage-based lottery system, sparking uncertainty among Indian tech workers and students. Finally, we cover several key developments within India, including a significant 191 percent surge in funding for the Indian pharmaceutical sector and the resumption of direct flights between India and China after a five-year hiatus. The brief concludes by highlighting India's 76th Republic Day celebrations, which underscored its growing defense indigenization and booming digital economy.",
      "details": [
        {
          "_id": "25",
          "title": "Trump 2.0 - Indians in the Cabinet and in attendance at the inauguration",
          "context": "Donald Trump was sworn in for his second term as the President of the United States on January 20, 2025, an inauguration marked by a narrative emphasizing strong border enforcement, \"American jobs for American workers,\" and \"unapologetic nationalism.\" Tip: President Trump's second term, as of early 2025, notably included at least half a dozen Indian-Americans in significant roles, including high-profile appointments like the Director of the FBI and the co-lead of the new Department of Government Efficiency, alongside the first Indian-origin Second Lady of the United States. His second term is anticipated to bring a more stringent approach to immigration vetting and surveillance of foreign students, particularly those from India and China. Key pathways for the Indian diaspora are under increased scrutiny, igniting widespread uncertainties for Indian families navigating US education and work opportunities. Indian Presence at the Inauguration: Despite the impending policy shifts, Trump’s inauguration saw a significant Indian turnout, highlighting the influence and impact of the Indian diaspora in the US. Usha Vance, the wife of Vice President-elect JD Vance, whose family hails from India’s southern Andhra Pradesh state, will serve as the first Indian-origin Second Lady of the United States, bringing Indian-American presence to the highest ranks of US political life. Prominent Indian attendees included External Affairs Minister S. Jaishankar, representing Prime Minister Narendra Modi as his special envoy, billionaire Mukesh Ambani and his wife Nita Ambani, chairman and director of Reliance Industries respectively. Indian-origin Google CEO Sundar Pichai was also in attendance. Other Indian business leaders present included Ashish Jain (Kundan Spaces), Kalpesh Mehta (Tribeca Developers, Trump Towers' Indian partner), and Pankaj Bansal (M3M Developers). Indian-American Representation in the Administration and the polarized diaspora: In Trump’s second term, six Indian‑Americans hold key positions in his administration, including Senior White House Policy Advisor on Artificial Intelligence Sriram Krishnan, co-head of the Department of Government Efficiency (DOGE) Vivek Ramaswamy, Assistant Attorney General for Civil Rights, US Department of Justice- Harmeet K. Dhillon, Director of the Federal Bureau of Investigation Kashyap Patel, Director of the National Institutes of Health Jay Bhattacharya, and White House Deputy Press Secretary Kush Desai. Direct inclusion of Indian Americans underscores their growing political clout. According to the 2024 Indian American Attitudes Survey, Indian-American respondents give the Democratic Party an average rating of 61 out of 100. Kamala Harris scores 63, while Minnesota Governor Tim Walz receives a 58. By contrast, the Republican Party scores 42, just one point higher than Donald Trump, who receives 41. Trump’s running mate, JD Vance, earns a 39 rating. Among Republican figures, Usha Vance is rated highest at 45, followed closely by Nikki Haley (44) and Vivek Ramaswamy (43). Overall, the Biden administration stands out for its appointment of over 130 Indian‑Americans to a wide array of key positions. In contrast, Donald Trump’s administrations, while featuring several highly prominent Indian‑American figures in influential roles, have shown a numerically smaller and more targeted approach.",
          "exalt_take": "The Indian American community’s political influence is growing undeniably but not monolithically. Winning their support goes beyond tokenistic representation and understanding their motivations, and including them meaningfully at all levels of governance. For Democrats, leverage this moment to reinforce trusted issues and focus conversations on healthcare, education, and economic opportunity, but frame them through the lens of family well-being and generational success. Partner with grassroots organizations and Indian American community leaders to build political capital rooted in long-term trust and mobilization. Offer clear, compassionate policies on H-1B, F-1, OPT, and family reunification. Immigration remains a top concern. For Republicans, highlight Indian American leaders’ appointments like Usha Vance, Kash Patel, and Vivek Ramaswamy and challenge the notion that the party lacks diversity while recognizing them as community liaisons. Other issues to touch upon would be merit-based immigration and economic nationalism resonate with business owners and skilled professionals. Avoid letting negative perceptions linger on minority rights or social conservatism. Clarify the party’s positions and find areas of alignment, such as family values or education. Indian Americans care about both personality and policy. Sustained, culturally fluent engagement, not just pre-election outreach, will influence long-term support.",
          "questions_from_community": [
            "How will the Trump 2.0 administration protect legal immigration pathways for Indian families and will the focus on enforcement further delay green cards and tighten H-1B access?",
            "Given the current rhetoric and policies, how can Indian Americans be assured they won’t be collateral damage in broader crackdowns on immigration or DEI programs?",
            "Do prominent Indian Americans in Trump's cabinet signal genuine influence for the community within the Republican Party and the administration's policy decisions?"
          ],
          "tag": "Politics",
          "section": "WHAT’S HAPPENING IN THE US",
          "posts": {
            "twitter_democratic": "“Token representation isn’t enough. Real trust comes from policies that support family well-being, generational success, and fair immigration pathways. #CommunityEngagement #USPolitics”",
            "twitter_republican": "“Trump 2.0 features Indian American leaders like Usha Vance, Kash Patel & Vivek Ramaswamy — proof that Republicans are expanding representation. #IndianAmerican #Leadership”",
            "instagram_facebook_democratic": "Indian Americans’ presence at Trump’s inauguration and in the new Cabinet is a powerful reminder of the community’s growing influence in U.S. politics. But representation must go beyond appearances. Sustained, culturally fluent engagement is how trust is built — not just pre-election outreach. #Representation #IndianAmerican #CommunityEngagement #ImmigrationReform",
            "instagram_facebook_republican": "Trump 2.0 includes Indian American leaders like Usha Vance, Kash Patel, and Vivek Ramaswamy — breaking the myth that the GOP lacks diversity. This moment reflects the rising role of Indian Americans across U.S. politics. Winning trust will require consistency, not token gestures. #IndianAmerican #Leadership #CommunityEngagement #USPolitics"
          },
          "further_reading": [
            "The India-U.S. Story: Biden’s Legacy and Trump 2.0",
            "From Jaishankar to the Ambanis, here is the list of prominent Indians invited to Donald Trump's inauguration"
          ],
          "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS60EYucPLVLkh-Qr8tTH1MRDsryGOQAoVjfg&s",
          "tweet_id": []
        },
        {
          "_id": "26",
          "title": "Trump-Modi Phone Call Signals Renewed Focus on Trade and Indo-Pacific Security",
          "context": "US President Donald Trump held a formal phone call with Indian Prime Minister Narendra Modi on January 26, 2025, his first since returning to office. Tip: Donald Trump and Narendra Modi have met several times during Trump’s first term including the massive Howdy Modi rally in Houston (2019, 50,000 attendees) and the Namaste Trump event in Ahmedabad (2020, over 100,000 attendees). Their relationship was notable for the large-scale joint rallies and public camaraderie. According to the White House readout, without making any specific agreements, they discussed “fair” trade relations, defense collaboration, and mutual interests in the Indo-Pacific region. India-US Trade Reset: In the financial year 2023-24, India-US bilateral trade hit $118 billion with US-India exports growing 98 percent and US-India imports growing 82 percent. During Trump’s first term, India’s exports to the US grew approximately 22 percent over four years. Under Biden, they jumped to approximately 51 percent in just three years. Trump has hinted at an “interim trade deal” before an August 1 tariff deadline; India’s exclusion from recent tariff letters signals progress. India-US Defense and Security Cooperation: Defense trade surged from near zero in 2008 to over $20 billion in 2020. India became a Major Defense Partner (MDP) in 2016 and gained Strategic Trade Authorization-1 (STA-1) status in 2018, streamlining high-tech defense trade, both under the Trump administration. In his first term, Trump solidified defense relations, setting up the 2+2 Ministerial Dialogue and signing key agreements like the Communications Compatibility and Security Agreement (COMCASA) in 2018 and the Industrial Security Annex (ISA) in 2019. Biden built on this, expanding Quad cooperation and technology sharing via the Initiative on Critical and Emerging Technologies (iCET), expanding the partnership with strategic alliances to foster cooperation in areas like AI, quantum computing, semiconductors, and advanced telecommunications. During the call, Trump emphasized the purchase of US military equipment by India continuing from the Biden-era focus on strategic tech transfers. Indian-American sentiment: According to the 2024 Indian American Attitudes Survey, views on US-India relations remain divided- 34% of Indian Americans say Biden has done a better job, while 28% feel Trump handled the relationship better during his first term. Another 26% believe both performed about the same, and 12% remained unsure. When asked which American political party manages US-India relations better, 41% of Indian American respondents chose the Democratic Party, compared to 24% who favored the Republican Party. Meanwhile, 25% saw no difference between the two, and 9% did not express an opinion. When it comes to the handling of US-India ties, the margin in the perceptions of the Democrats and Republicans remains relatively narrow, highlighting a closely divided Indian American electorate. This presents an opportunity for public office holders to meaningfully engage with the Indian American community and garner their support.",
          "exalt_take": "As Indian Americans become increasingly engaged, strategic outreach and concrete policy attention to their priorities such as immigration, education, and bilateral ties, could prove decisive in securing their support, donations, and votes, especially in key battleground states. Trump’s renewed dialogue with Modi may appeal to a segment of the diaspora that values strong symbolic and strategic ties with India. For Republicans, emphasize how Trump’s early outreach to Modi underscores India’s strategic importance as a key US ally. Lean into the optics and past successes of the Modi-Trump partnership to highlight continuity and strength. Issue statements or social media posts reaffirming support for strong US-India ties, referencing past joint events like Howdy Modi and Namaste Trump as markers of trust and mutual respect. Point to India as a valued partner in trade, defense, and Indo-Pacific stability. For Democrats, acknowledge the phone call as an opportunity to build on the deep institutional ties forged under the Biden administration, including defense tech transfers and a rules-based Indo-Pacific vision. Frame public responses around safeguarding the bipartisan momentum in US-India relations highlighting achievements like the iCET (Initiative on Critical and Emerging Technology) and increased Indian American representation as milestones to preserve and build upon.",
          "questions_from_community": [
            "Do you believe a strong Modi-Trump relationship is a reliable indicator of a strong US-India partnership overall?",
            "Is personal camaraderie between leaders like that of Modi and Trump a key driver in advancing bilateral negotiations and outcomes?",
            "Given that Prime Minister Modi was President Trump’s first official call after taking office, does this signal India’s elevated role in US foreign policy over the next four years?",
            "Is India now the United States’ most important partner in counterbalancing China’s growing influence in the Indo-Pacific region?",
            "Can symbolic gestures like high-profile rallies and early phone calls translate into tangible outcomes on trade, visas, or strategic tech transfers?"
          ],
          "tag": "Trade, Defense, Diplomacy",
          "section": "WHAT’S HAPPENING IN THE US",
          "posts": {
            "twitter_democratic": "“Bipartisan momentum has made U.S.–India ties stronger than ever. We need to safeguard that progress, not let it swing with personalities. #USIndia #StrategicPartnership”",
            "twitter_republican": "“Trump’s renewed outreach to Modi shows India’s importance as a U.S. ally. From Howdy Modi to Namaste Trump, the partnership has been strong — and will only grow. #USIndia #IndoPacific”",
            "instagram_facebook_democratic": "The phone call between Donald Trump and Prime Minister Modi underscores India’s growing importance in U.S. strategy — but the true foundation of the partnership is bipartisan progress. Over the last four years, milestones like iCET (the Initiative on Critical and Emerging Technologies), defense tech transfers, and growing Indian American representation have cemented U.S.–India ties. This is about sustaining trust, not letting it swing with political cycles. #USIndia #IndoPacific #StrategicPartnership #iCET",
            "instagram_facebook_republican": "Trump’s renewed dialogue with Prime Minister Modi sends a strong signal: India remains a cornerstone U.S. ally. The Modi–Trump partnership has delivered memorable milestones — from Howdy Modi in Houston to Namaste Trump — symbols of trust and mutual respect. For many in the Indian diaspora, continuity in this partnership resonates deeply. #USIndia #IndoPacific #StrategicAllies #TrumpModi"
          },
          "further_reading": [
            "Modi-Trump starts well with White House talks in February",
            "\"Mutually Beneficial, Trusted Partnership\": PM Modi's Phone Call With Trump"
          ],
          "image": "https://c.ndtvimg.com/g5kng48g_modi-trump_625x300_04_September_18.jpg?downsize=545:307",
          "tweet_id": []
        },
        {
          "_id": "27",
          "title": "Indian student Ravi Teja shot dead hours before Trump’s inauguration",
          "context": "A 26‑year‑old Indian student Ravi Teja Koyyada from Telangana was fatally shot while delivering food in Connecticut. Teja had arrived in the US in March 2022 to pursue his degree and was working part‑time while job hunting after graduation. Tip: Nationally, FBI data shows 11,862 hate-crime incidents involving 13,829 victims in 2023, the highest annual total on record. The shooting occurred just hours before a high-profile presidential inauguration, and the police are treating the incident as a homicide with potential hate‑crime motives, considering the victim’s ethnicity and the tense political atmosphere. Hate Crimes in the US: Incidents of racism against South Asians show disturbing numbers. According to Stop AAPI Hate/NORC survey, 74 percent of young Asian Americans (ages 18- 29) reported experiencing a hate act in 2024. Over half (53%) of AAPI adults faced some form of harassment, violence, or discrimination. After the 2024 US election was called, anti-Asian online slurs surged by 66 percent, peaking at 87,945 in January 2025, with three out of every four targeting South Asians. Online threats of violence followed the same trend with 973 in August 2024 alone, 75 percent aimed at South Asians. According to US Department of Justice’s data, race and ethnicity remain the leading motivation behind hate crimes in 2023, accounting for approximately 52.5 percent of all single-bias incidents, followed by religion and sexual orientation. Gun violence and Indian American attitudes towards gun reform: In recent years, over 10,300 hate‑crime victims annually involved firearms including direct threats, intimidation, or shootings. FBI data shows that approximately 80 percent of all homicides involved a firearm, making gun involvement a significant risk in bias-driven violence. In a 2022 AAPI Data survey, 83 percent of Indian Americans supported stronger US gun laws, including universal background checks and stricter licensing requirements. Most Indian Americans perceive household gun ownership as a risk and favor regulations like mental health evaluations, regular license renewals, and waiting periods. According to US Immigration and Customs Enforcement (ICE) there are 1.58 million active F‑1/M‑1 student SEVIS records in 2024, with 420,000 Indian students, making up the largest international student population in the US.",
          "exalt_take": "The fatal shooting of Ravi Teja Koyyada is not an isolated incident it is rooted in a broader crisis of safety, bias-driven violence, and institutional neglect that Indian and South Asian communities in the US are faced with. For Democrats, reaffirm commitment to racial equity by voicing support for South Asian populations especially focusing on students while leveraging this moment to advocate for gun reform. Set up local task forces to track and prosecute hate-motivated crimes targeting immigrant and student communities. Partner with community-led platforms like Stop AAPI Hate to bridge the underreporting gap and build trust in institutions. For Republicans, address campus and community safety as a public order issue and advocate for expanded law enforcement visibility in areas with large international student populations. Support digital safety legislation targeting hate speech and incitement from foreign and domestic extremist networks. Make clear that protecting Indian-origin Americans aligns with protecting American allies. Back bipartisan resolutions condemning bias-driven attacks against all minority communities, reaffirming America’s commitment to safety and freedom of global talent.",
          "questions_from_community": [
            "Will there be justice for Ravi Teja or will this be another forgotten headline?",
            "Do you believe gun reform laws would help prevent fatal hate crimes like the one that killed Ravi Teja?",
            "Do you believe that the online hate directed at Indian Americans translates into real-world violence?",
            "What kind of community or campus-level interventions are needed to ensure safety of international students?"
          ],
          "tag": "Hate Crimes, Gun Violence, Student Safety",
          "section": "WHAT’S HAPPENING IN THE US",
          "posts": {
            "twitter_democratic": "“Ravi Teja’s tragic death reminds us: immigrant students deserve safety, dignity, & equity. Gun reform and stronger hate crime accountability is long overdue. #StopAAPIHate #GunReformNow”",
            "twitter_republican": "“Protecting Indian-origin Americans means protecting allies & talent. Stronger enforcement against extremist networks is critical. #PublicSafety #USIndia”",
            "instagram_facebook_democratic": "The fatal shooting of Ravi Teja is not just an isolated act of violence — it reflects systemic threats faced by Indian and South Asian students across the U.S. Safety is not optional — it’s a right. #GunReform #StopAAPIHate #StudentSafety",
            "instagram_facebook_republican": "The murder of Ravi Teja, an Indian student, underscores the need for stronger safety measures for our international communities. Protecting Indian Americans = protecting U.S. allies & ensuring America remains the destination for global talent. #LawAndOrder #CampusSafety #USIndia"
          },
          "further_reading": [
            "Telangana student shot dead in US",
            "83% Of Indian Americans Say We Need Stricter Gun Laws",
            "As Harris, Ramaswamy, Usha Vance rose on national stage, Indian Americans faced harassment"
          ],
          "image": "https://i.ytimg.com/vi/X60FfJv07SE/sddefault.jpg",
          "tweet_id": []
        },
        {
          "_id": "28",
          "title": "H‑1B rule modernization alters Visa Lottery beginning Jan. 17, 2025 sparks alarm among Indian tech workers",
          "context": "On January 17, 2025, the Department of Homeland Security’s H‑1B modernization rule will take effect, fundamentally reshaping how approximately 85,000 annual H‑1B visas are awarded. Tip: In the financial year 2023, 73 percent of H‑1B approvals went to Indian-born workers, while China trailed at 12 percent, and no other country exceeded 2 percent. Under the new framework, DHS will prioritize applications offering higher salaries, introducing a tiered, wage-based selection process, and limiting submissions to one per individual, even if they have multiple job offers. Indian workers face sharper odds: The new wage-tier system favors high-salary offers, sidelining many qualified Indian applicants from smaller firms or startups. Those from modest backgrounds or non-prestige employers are most vulnerable. USCIS received 780,884 H‑1B registrations in FY 2024 but selected just 110,791 for processing, making the odds a 14 percent chance per entry. Indian-born workers made up about 67.7% of FY 2024 registrations. With more than two-thirds of applicants from India, this group faces the steepest impact from the new rules. Indian students, 331,602 in 2023, are the largest international cohort in US universities. Many transition to H‑1B status to stay post-graduation. Policies allowing one entry and favoring higher salaries significantly undercut their ability to secure visas. H-1B workers power US tech: In 2023, a record 755,020 H‑1B visa holders were admitted to the US, underscoring the program’s scale, up from about 570,000 in 2018 and approximately 410,000 in 2022. These high-skilled professionals largely fill computer-related positions, fueling innovation across sectors. As of 2022, 55 percent of US unicorns (319 of 582 startups valued at ≥$1B) had at least one immigrant founder and 66 of them Indian-origin, the single largest national bloc. Many entered the US as international students or H‑1B holders, laying the groundwork for transformative innovation. The H‑1B program goes beyond visas, it’s the foundation of a pipeline that brought three-quarters of US billion-dollar startups into reality. Altering H-1B procedures isn’t just policy reform, it is a move that determines the very future of American innovation led by global talent.",
          "exalt_take": "Policymakers must recognize that shifts in immigration policies and legitimate pathways to immigration such as the H-1B program have far-reaching impacts on the Indian diaspora in the US. It speaks to their personal struggles and generations of immigrant stories. For Democratic lawmakers, uphold your commitments to immigrant inclusion by pushing for a more equitable wage-tier system that doesn’t disadvantage early-career professionals. Consider legislative pathways that protect work rights for international graduates, including faster green card processing and increased OPT flexibility. Recognize the personal impact of H-1B on Indian Americans and reassure the communities of support by advocating for equitable reform. For Republicans, Indian H‑1B workers have helped build 1 in 4 US billion-dollar startups. preserve the US’ tech edge by ensuring visa policy rewards merit and innovation, not just salary. Reforms should curb abuse but not at the cost of sidelining core talent.",
          "questions_from_community": [
            "Why are early-career professionals being penalized?",
            "Do you believe tying visa selection to salaries rather than skills helps or hurts long-term American innovation?",
            "Why should Indian families invest in US education when immigration pathways are getting narrower each year?"
          ],
          "tag": "Immigration, H1B, Tech Workers",
          "section": "WHAT’S HAPPENING IN THE US",
          "posts": {
            "twitter_democratic": "“The H-1B program isn’t just a policy—it’s the livelihood of thousands of Indian professionals & families. We must reform equitably: fair wages, faster green cards, & OPT flexibility. #ImmigrantJustice #H1B”",
            "twitter_republican": "“Indian H-1B talent has helped build 1 in 4 U.S. billion-dollar startups. Visa reforms should reward merit & innovation—not just high salaries. #TechLeadership #H1B” OR “America wins when we attract the best. H-1B modernization must curb abuse without sidelining the very talent that drives our economy. #MeritBasedImmigration #USIndia”",
            "instagram_facebook_democratic": "For Indian American families, the H-1B program is more than a visa—it’s a generational bridge to opportunity. This is about dignity, fairness, and inclusion. #ImmigrantJustice #H1BReform",
            "instagram_facebook_republican": "Indian H-1B professionals have played a crucial role in driving U.S. innovation—helping launch 1 in 4 billion-dollar startups. This is about competitiveness and opportunity. #TechLeadership #MeritBasedImmigration #H1B"
          },
          "further_reading": [
            "What are H-1B visas and how might the Trump administration change them?",
            "Explainer: Trump 2.0: What's the conservative row over H-1B visas?"
          ],
          "image": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2025/03/h-1b-visa-1741332525.jpg",
          "tweet_id": []
        },
        {
          "_id": "29",
          "title": "Indian Americans Gain Political Ground in US State-Level Elections",
          "context": "Democrat Balvir Singh became the first Sikh American to be elected to the New Jersey General Assembly from District 7 on January 30, 2025, and one of several Indian-origin leaders elected this year. Tip: By late 2024, six Indian‑Americans had won seats in the US House (up from five), marking the strongest Indian‑American representation ever recorded in Congress. Increased Indian American representation in public offices: In 2000, only 5 Indian Americans had ever been elected to public office in the United States. In 2024, there were more than 300 South Asian American elected leaders serving in more than 23 state legislatures, including battlegrounds like Georgia, Pennsylvania, Michigan, and Arizona. Increasing political engagement among Indian Americans: Indian-American political action committees, including groups like Indian American Impact Fund, AAPI Victory Fund, Hindu American PAC (HAPAC), and local state-level coalitions have emerged as both advocacy hubs and financial backers. Founded in 2016, Indian American Impact Fund has endorsed and supported 198 candidates across the country, contributing to the historic rise of Indian and South Asian American representation in politics. It has also drawn up over $20 million to candidates and made efforts for robust voter mobilization and policy advocacy. The median annual income of Indian-American households was $151,200 in 2023, nearly double the national median. This economic strength significantly enhances their political influence through donations, lobbying, and PAC activity, which in turn shapes key political races.",
          "exalt_take": "Indian Americans are no longer political outsiders. The community is not just voting on legislation, it is shaping it. Public officials must recognize the growing political clout of Indian Americans and engage with the diaspora as such. For Democrats, publicly welcome the success of Indian American leaders like Balvir Singh, issue statements in support of the value diversity and representation adds to the political system across the different levels of governance. Advocate visibly on diaspora-relevant federal issues like H-1B reforms, religious protections, and US-India cooperation. For Republicans, Balvir Singh’s victory might seem like a partisan win, but the Indian diaspora is more engaged politically than ever before. Proactively engage Indian-American community leaders and entrepreneurs. Recruit Indian-American candidates in districts where cultural conservatism and economic pragmatism align with Republican principles. Issue statements to highlight shared values, including merit-based immigration reform, school choice, and religious freedom.",
          "questions_from_community": [
            "Do you believe Balvir Singh’s appointment marks a meaningful shift in how American politics engages with minority communities?",
            "Do you agree that there is value in diversity and representation, ot just symbolically, but in shaping better legislation?",
            "Do you see Indian-American political participation as reshaping the party's political approach to outreach and coalition building?"
          ],
          "tag": "Politics",
          "section": "WHAT’S HAPPENING IN THE US",
          "posts": {
            "twitter_democratic": "“From H-1B reform to US-India ties, Democrats must stand visibly with Indian American leaders and communities. #DiversityInPolitics”",
            "twitter_republican": "“Indian Americans value merit, entrepreneurship, and family. Republicans can connect on school choice, immigration reform & religious freedom. #SharedValues”",
            "instagram_facebook_democratic": "Indian Americans are not just voting—they’re shaping legislation. Leaders like Balvir Singh prove that representation strengthens democracy at every level. Representation isn’t symbolic—it’s substantive. #RepresentationMatters #IndianAmericanVoices",
            "instagram_facebook_republican": "Indian Americans are now key players in U.S. politics. Singh’s victory is proof of a politically energized diaspora. This is about building real coalitions, not overlooking one of America’s most influential immigrant groups. #SharedValues #GOPOutreach"
          },
          "further_reading": [
            "Notable Indian-Americans who secured major victories in the 2024 US Elections",
            "‘Could we have imagined this moment would come?’: Kamala Harris and the rise of Indian American politicians",
            "'In the US, the Indian diaspora has a political influence that far exceeds its demographic weight'"
          ],
          "image": "https://static.theprint.in/wp-content/uploads/2019/10/Howdy-Modi-event-e1571385322277-696x392.jpg?compress=true&quality=80&w=376&dpr=2.6",
          "tweet_id": []
        },
        {
          "_id": "30",
          "title": "ICE raids spark fear and anxiety among Indian students in US",
          "context": "US Immigration and Customs Enforcement (ICE) raided a business site on January 23, 2025, in New Jersey’s most populous city, Newark, detaining several undocumented workers and triggering fears across local immigrant communities. Tip: India surpassed China as the top place of origin for international students, with a record-high 331,602 Indian students in the US in 2023-2024. Among detainees were some Indian international students working informally while on F-1 student visas. Indian students, especially those from lower-income backgrounds, are left vulnerable amid Trump’s crackdown on illegal immigration. Economic impact of Indians in the US: The Indian student community, numbering over 300,000, is estimated to contribute more than $8 billion annually to the US economy. According to recent estimates for the 2023-24 academic year, this figure is suggested to be as high as $11.8 billion out of the total $43.8 billion contributed by all international students. Beyond education, Indian-Americans profoundly impact the US economy. Indian-origin CEOs lead 16 Fortune 500 companies, employing 2.7 million Americans and generating nearly $1 trillion. They've co-founded 72 US unicorns (valued over $195 billion, employing 55,000+), own roughly 60 percent of US hotels, pay an estimated $250-$300 billion annually in income taxes, and their businesses indirectly create 11-12 million American jobs. ICE raids and increased enforcement efforts create an atmosphere of fear and uncertainty within immigrant communities, which includes many international students. Research suggests that immigration raids lead to increased student absences in affected areas, indicating a sense of insecurity.",
          "exalt_take": "The ICE raid in Newark may have been targeted, but it has a far-reaching impact. Indian international students, among the top contributors to the US higher education economy, are increasingly discouraged to pursue their education in a country that increasingly treats them as expendable and seek safer alternatives elsewhere. For public office holders, this is both a case of visa compliance and also economic self-interest. For Democrats, extend support to international students and push for stronger guardrails against broad ICE enforcement actions that entrap student populations. Lean into messaging that frames international students as contributors, not violators, especially in battleground states with large university populations. For Republicans, consider the economic cost of aggressive enforcement. Indian students bring billions in tuition and spending annually, and many go on to become job creators and STEM leaders. Put out a message that separates border security from high-skilled student engagement and reassure those seeking legitimate pathways to immigration.",
          "questions_from_community": [
            "Don’t Indian students deserve better treatment given their immense contribution to the US economy and society?",
            "Will ICE and other immigration enforcement agencies be held accountable for reported mistreatment of international students?",
            "How do you plan to ensure the safety and legal clarity for international students working part-time to support themselves?",
            "Do you believe aggressive immigration enforcement deters global talent from choosing the US for higher education?"
          ],
          "tag": "Immigration, Student Safety, ICE",
          "section": "WHAT’S HAPPENING IN THE US",
          "posts": {
            "twitter_democratic": "ICE raids don’t just target violators—they discourage international students who bring billions to U.S. universities. Students are contributors, not expendable. #ProtectStudents #IndianAmericanVoices",
            "twitter_republican": "“Indian students contribute billions & many become U.S. STEM leaders. We must separate border enforcement from student engagement. #SmartPolicy #USIndia”",
            "instagram_facebook_democratic": "ICE raids may target a few—but they reverberate across entire student communities. Indian students, the largest international student group in the U.S., are left anxious about their futures. This is about dignity, fairness, and the future of American higher education. #ProtectStudents #IndianAmericanVoices",
            "instagram_facebook_republican": "America’s universities thrive because of international talent. Indian students alone contribute billions to tuition, local economies, and the STEM pipeline. Protecting lawful, high-skilled talent is in America’s national interest. #SmartPolicy #USIndia"
          },
          "further_reading": [
            "How the U.S. Betrayed International Students",
            "Undocumented Students Are Living in Fear on College Campuses. The Effects of Campus Raids"
          ],
          "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQeZDcylANL6uhN7vyk2DjIQqxQ0OrIHkvF5Q&s",
          "tweet_id": []
        },
        {
          "_id": "31",
          "title": "Indian pharmaceuticals sector garners $300 million in funding, marks a 191% month-on-month surge",
          "context": "India's pharmaceutical and healthcare sector secured a staggering $300 million in January 2025, a 191.26 percent surge from December’s $103 million, driven by private equity rounds. Tip: India meets 40 percent of all generic medicine demand in the US, and 20 percent of global generic volume. India’s pharmaceutical exports to the US: India’s pharmaceutical exports to the United States reached $12.7 billion in 2024, accounting for roughly 36 percent of India’s total pharma exports and underscoring America as the single largest market for Indian pharmaceutical products. According to the United Nations Comtrade data, as shown above, US imports of Indian pharmaceutical goods have been on a steady rise. The recent increase in funding reflects investor confidence and India’s growth trajectory in the pharmaceutical sector, creating an opportunity for the US to enhance collaboration, diversify supply chains, and buffer against geopolitical shocks. India-US pharma collaboration beyond trade: India ranks among the top five countries across the world for hosting US-sponsored clinical trials. With costs associated with drug development exceeding $2.6 billion per year, a cost-effective trial is vital for sustained innovation. India also leads with 376 FDA-registered facilities as of 2024, including 200 Active Pharmaceutical Ingredient plants and 134 dosage-form sites, more than any country outside the US. Together, these assets position India as a critical partner for the United States in advancing cost-efficient drug development, ensuring diversified supply chains, and building long-term pharmaceutical ties.",
          "exalt_take": "The $300 million funding surge is more than capital inflow, it’s a strategic endorsement of India as a trusted pharmaceutical ally. For US stakeholders, the message is clear- to recognize Indian pharma beyond an exporter of products For Democrats, recognize India’s crucial role as a supplier of generics and advocate for expanding collaborative research frameworks and easing joint FDA review processes. Support policies that encourage global clinical trial partnerships, with a focus on legislations that help lower costs and improve healthcare access without compromising standards. For Republicans, voice support for India as a reliable, market-driven counterweight to Chinese pharmaceutical dependence. Support private-sector investment in Indian pharma infrastructure, especially for Active Pharmaceutical Ingredients (APIs). Fast-track US-India pharma trade agreements that secure long-term access to affordable generics and critical medications, boosting domestic resilience without large-scale government spending.",
          "questions_from_community": [
            "Does the rapid expansion of India’s domestic pharmaceutical sector affect the US drug market and supply chains?",
            "Do you view India as a strategic counterbalance to overdependence on China in the pharmaceutical sector?",
            "Could greater private-sector collaboration with India help reduce drug costs and improve access to generics in the US?",
            "What is your stance on strengthening FDA cooperation with Indian pharma manufacturers to streamline approvals while ensuring quality?"
          ],
          "tag": "Pharma, Economy, Investment",
          "section": "INDIAN ISSUES",
          "posts": {
            "twitter_democratic": "“$300M surge in Indian pharma is more than capital—it’s trust. Expand FDA collaboration & global trials to lower drug costs & boost healthcare access. #USIndia #IndianAmericanVoices”",
            "twitter_republican": "“$300M funding in Indian pharma shows strength. U.S. must back India as a market-driven pharma partner & counter to Chinese dependence. #SmartPolicy #USIndia”",
            "instagram_facebook_democratic": "India’s pharmaceutical sector just secured $300M in funding—a 191% surge. For Americans, this isn’t just an economic story, it’s about healthcare access. This is how we lower costs while keeping patients first. #AffordableHealthcare #USIndia",
            "instagram_facebook_republican": "India’s $300M pharma funding surge is a clear signal—America has a reliable partner to reduce dependence on Chinese supply chains. Smart, market-driven partnerships = stronger America. #PharmaResilience #USIndia"
          },
          "further_reading": [
            "Funding in healthcare, lifesciences hikes to $ 300 m",
            "Indo-US Pharma Alliance: Time to Step Up"
          ],
          "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQYpJ7LqYHpwq9o1da6HvGj95wV9-z036cTyw&s",
          "tweet_id": []
        },
        {
          "_id": "32",
          "title": "India and China resume direct flights after almost five years, pursue diplomatic engagement",
          "context": "On January 18, 2025, India’s External Affairs Minister S. Jaishankar reiterated that New Delhi’s China policy is anchored in “mutual respect, mutual sensitivity and mutual interests,” as the two countries take a step toward diplomacy and dialogue. Tip: India claims its border (Line of Actual Control) with China runs 3,488 km long, spanning from Ladakh in the west to Arunachal Pradesh in the east. China, however, recognizes only about 2,000 km, excluding disputed sectors like Aksai Chin and parts of Arunachal Pradesh. India and China also agreed to resume direct passenger flights after a near five-year hiatus due to pandemic disruptions and border tensions. India-China ties: Despite a thaw in ties, the military standoff continues. According to Carnegie, over 100,000 troops are still deployed on both sides in Eastern Ladakh since the 2020 Galwan clash. While disengagement agreement is a welcome development, no long-term border demarcation has been made, keeping the situation volatile. In terms of trade, in the fiscal year 2024-25, bilateral trade totaled a robust $127.7 billion, with India importing $113.5 billion worth of Chinese goods, while exporting only $14.3 billion. This left India with a trade deficit of $99.2 billion, driven largely by electronics, solar cells, and EV batteries. This could serve as a strategic opening for US interests which align with India’s pivot to drive regional supply chains away from China. US stance on India-China Flashpoints: China is the main arms supplier for Pakistan, accounting for 81 percent of its weapon imports between 2020 and 2024. It delivers critical systems like J-10CE fighter jets, VT‑4 tanks, and missile defense platforms. Despite maintaining strategic relationships with both India and Pakistan, the US-India defence partnership has deepened in an attempt to counterbalance Chinese influence in the Indo-Pacific. Another longstanding issue between India and China is their differing stance on the legitimacy of an independent Tibet. India provides sanctuary to Dalai Lama, the Tibetan spiritual leader in exile and his religious and political institution. In Congress, US lawmakers have backed India’s position by passing the Resolve Tibet Act and meeting with the Dalai Lama in Dharamshala, directly challenging Beijing’s authority over Tibetan succession. Finally, China controls refining capacity for 60 to 90 percent of globally essential minerals, including rare earths, cobalt, graphite, and lithium, crucial for clean energy, electronics, and defense. India has reserves but limited processing infrastructure, another domain in which US interests align to foster deeper collaboration.",
          "exalt_take": "India’s reengagement with China reflects a careful calibration of diplomacy and deterrence, and must be viewed pragmatically. For public officials, this reinforces India’s role in ensuring Indo-Pacific stability and bipartisan US support for India as a strategic ally must remain strong. For Democrats, issue statements encouraging diplomacy and military disengagement while supporting Indo-Pacific diplomatic frameworks like the Quad and IPEF. For Republicans, while acknowledging the diplomatic engagement, underscore the vitality of strong India-US ties in key sectors such as defense and position India as a long-term security partner capable of counterbalancing Chinese military assertiveness. Both parties should support joint critical minerals strategies and infrastructure financing to boost collaboration in areas of other shared interests.",
          "questions_from_community": [
            "Do you believe China can be trusted to uphold its border agreements with India given past violations?",
            "Is India the United States’ most important strategic partner in the Indo-Pacific?",
            "Should the US take a more vocal and consistent stance in support of Indian interests, particularly on cross-border terrorism and the Kashmir issue, given India’s central role in maintaining regional stability?"
          ],
          "tag": "Diplomacy, Geopolitics, India-China relations",
          "section": "INDIAN ISSUES",
          "posts": {
            "twitter_democratic": "“India-China flights resume after 5 yrs—a reminder that diplomacy & deterrence must go hand in hand. U.S. should back India in Quad & IPEF to ensure Indo-Pacific stability. #USIndia”",
            "twitter_republican": "“India’s outreach to China shows why strong U.S.-India defense ties are vital. India remains the long-term partner to counter Chinese military assertiveness. #IndoPacific #USIndia”",
            "instagram_facebook_democratic": "After nearly 5 years, India and China have resumed direct flights and re-opened channels of engagement. For the U.S., this moment underscores why support for diplomacy-first Indo-Pacific frameworks like the Quad and IPEF is critical. #DiplomacyFirst #IndoPacificStability",
            "instagram_facebook_republican": "India’s re-engagement with China is pragmatic, but it reinforces a truth: U.S.-India defense ties are vital. China’s military assertiveness won’t fade, and India is the long-term partner capable of counterbalancing it. #StrategicAllies #USIndia"
          },
          "further_reading": [
            "India and China agree to resume air travel, facilitate exchange of journalists",
            "As Trump returns, Sino-Indian relations are changing",
            "India views China as its primary adversary, Pakistan more an ancillary security problem: US defence intelligence report"
          ],
          "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRhodtGyk6G2Qo7lzUaTFg_RJYmacNQxE33Dw&s",
          "tweet_id": []
        },
        {
          "_id": "33",
          "title": "India celebrates its 76th Republic Day",
          "context": "India celebrated its 76th Republic Day on January 26, 2025 in New Delhi with a display of military might and cultural heritage under the theme \"Swarnim Bharat: Virasat aur Vikas\" (Golden India: Heritage and Development). Tip: While no US official was present at the celebrations, the tone of India-US ties was unmistakably warm. U.S. Secretary of State Marco Rubio extended heartfelt congratulations, touting the partnership between the two democracies as “the defining relationship of the 21st century” while reaffirming future cooperation in space, Quad initiatives, and economic ties. Indonesian President Prabowo Subianto attended the celebrations as the Chief Guest, highlighting India's strengthening ties within the Indo-Pacific region. “Make in India” Defense: The annual Republic Day parade featured indigenous defense equipment, a display of India's push towards defense indigenization. This strategy aims to reduce import dependency and foster a robust domestic defense industrial base. Nearly 65 percent of India’s defense equipment is now domestically produced and Inida’s defense exports surged to a record high of ₹23,622 crore (approx. US$ 2.76 Billion) in 2024-25, representing a 12.04 percent growth over the previous fiscal year. Made-in-India defense products are now being exported to nearly 100 countries with the US becoming the largest importer of Indian defense products, accounting for nearly 50% of India's total defense exports. India’s “Vikas” (Development) Theme: With rapid advancements in digital public infrastructure India’s UPI transactions in January 2025 crossed 16.99 billion with a value exceeding ₹23.48 lakh crore (approx. US $282 billion). India also boasts of the 3rd largest startup ecosystem globally, with over 1.59 lakh recognized startups and over 100 unicorns as of early 2025. Strategic collaborations, like the US-India Information and Communications Technology (ICT) Working Group, support secure digital connectivity. India-US are advancing collaboration in 5G and 6G, Artificial Intelligence (AI), Open Radio Access Networks (Open RAN), and cross-border data flows. There is also an increased focus on building trusted and enduring supply chains for critical technologies, including semiconductors, with a shared vision for a digitally empowered future.",
          "exalt_take": "India celebrated its 76th Republic day, and continued to amplify the message that is a crucial peer in global affairs, especially in Indo-Pacific security and the innovation space. US public office holders must issue statements congratulating the world’s largest democracy on its increasing global stature and recognize it as a vital ally. For Democrats, India’s technological leap in fintech, startups, and digital public infrastructure offers a rare bipartisan opportunity to collaborate on inclusive innovation, supply chain resilience, and climate-tech solutions, areas that align well with progressive foreign policy priorities. Supporting India’s digital and industrial scale-up can also bolster US efforts to offer a democratic alternative to Chinese influence. For Republicans, India’s emphasis on defense indigenization, coupled with US dominance in India's defense exports, validates the Indo-Pacific security logic behind deepening bilateral defense co-production, joint exercises, and weapons systems integration. As India seeks to scale up as a counterbalance to Chinese aggression, continued bipartisan defense technology cooperation can help build lasting security architecture in Asia.",
          "questions_from_community": [
            "Do you think that the US should deepen co-production and co-development deals with India to encourage its defense indigenization goals?",
            "Should the US invest more diplomatically and financially in India’s tech ecosystem as a counterweight to Chinese digital influence?"
          ],
          "tag": "Culture, Defense, Digital Economy",
          "section": "INDIAN ISSUES",
          "posts": {
            "twitter_democratic": "“Congrats to India on its 76th #RepublicDay — a proud moment for the world’s largest democracy. Let’s expand U.S.-India cooperation in inclusive innovation, fintech & climate tech. #USIndia”",
            "twitter_republican": "“India’s 76th #RepublicDay marks its rise as a trusted ally in Indo-Pacific security. U.S.-India defense cooperation is vital to counter Chinese aggression. #StrategicAllies”",
            "instagram_facebook_democratic": "Today, India celebrates its 76th Republic Day — honoring its democracy while showcasing its growing global influence. For Democrats, this moment is more than ceremonial. India’s digital revolution in fintech, startups, and public infrastructure is shaping the global innovation economy. By working together, the U.S. and India can offer a democratic alternative to authoritarian models of growth and help secure a more equitable global order. #RepublicDay #USIndia #InclusiveInnovation",
            "instagram_facebook_republican": "India’s 76th Republic Day is a celebration not only of democracy but of India’s strategic rise as a security partner. Republic Day is a reminder that our security and prosperity are stronger with India at our side. #RepublicDay #StrategicAllies #USIndiaDefense"
          },
          "further_reading": [
            "India's Republic Day marked by fighter jet formations, daredevil stunts",
            "US-India Ties: The Defining Partnership of the 21st Century",
            "India-US reaffirm commitment to secure digital connectivity, focus on AI collaboration"
          ],
          "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSqjUywmn3Gt-Gbre2HORgpVDWDmJJDFW9IPA&s",
          "tweet_id": []
        }
      ]
    },
    "february": {
      "exalt_summary": "This brief covers major developments that impacted the Indian diaspora and US-India relations in February 2025. We begin by examining a series of high-level diplomatic and economic events. Prime Minister Modi and President Trump launched the US-India COMPACT initiative, which aims to boost military partnerships and trade. This was followed by a meeting between Modi and Elon Musk during which they discussed collaboration in space and technology. We also focus on two notable incidents affecting the Indian diaspora. The tragic hit-and-run involving student Nilam Shinde brought to light lapses in emergency protocols, highlighting the challenges faced by Indian nationals in the US. Additionally, Indian-Americans mobilized against racial bias following the controversial rehiring of an engineer with a history of anti-Indian remarks to the Department of Government Efficiency (DOGE). The brief also covers a review of a significant immigration event- the deportation of over 100 Indians from the US via a military aircraft, signaling a more stringent approach to immigration enforcement. Finally, we analyze India's Union Budget for 2025-26, which includes continued opportunities for US investment, and India's decision to lower tariffs on bourbon whisky, a move praised by American distillers. In a separate development, India and Israel convened high-level business forums to deepen their economic ties.",
      "details": [
        {
          "_id": "34",
          "title": "Hit‑and‑run victim Nilam Shinde highlights lapses in emergency protocols",
          "context": "Nilam Shinde, an Indian postgraduate student, sustained severe injuries in a Sacramento hit-and-run and remains comatose. Her family faced major bureaucratic hurdles in obtaining emergency visas, which prompted intervention from the Indian consulate. Tip: In the past five years, 633 Indian students have died abroad, with 108 fatalities occurring in the US alone. This alarming statistic, which includes both violent attacks and accidents, emphasizes the dire need for robust and immediate consular and institutional support mechanisms. The case highlights the urgent need for clearer, more efficient emergency protocols for Indian students abroad, including streamlined consular support, prioritized emergency visa processing, and improved university crisis coordination. Hit-and-runs in the US: Between 2018 and 2022, over 4 million people in the US were involved in hit-and-runs, with more than 12,000 of these incidents involving fatalities. In 2022 alone, 2,854 fatalities resulted from hit-and-run crashes. This translates to a hit-and-run crash occurring approximately every 43 seconds in the US, underscoring the constant risk faced by pedestrians and road users, including international students. According to US Immigration and Customs Enforcement (ICE) there are 1.58 million active F‑1/M‑1 student SEVIS records in 2024, with 420,000 Indian students, making up the largest international student population in the US. Although the US Department of State offers expedited visa appointments for urgent, unforeseen situations like medical emergencies, the official US Embassy & Consulates in India website explicitly states that \"expedited appointment slots are very limited\" and that \"due to the high volume of requests, we cannot accommodate all travelers prior to their planned travel dates, even if the purpose of travel is time sensitive.\" Overburdened US Consulates and mounting visa backlogs: The increasing demand for US visas from countries like India, along with pandemic backlogs, staffing challenges, and policy shifts, has placed immense pressure on US consulates and embassies leading to major backlogs across various visa categories, including those critical for emergency travel. In 2023, US Embassies and Consulates in India processed a record 1.4 million visa applications, making India the second-largest consular operation for the US globally (after Mexico). Despite a reported increase in staffing by over 33 percent in recent years, the US Citizenship and Immigration Services (USCIS) is facing a record backlog of 11.3 million pending immigration cases across all categories. Recent US government mandates for a 10 percent reduction in embassy staff worldwide are projected to further result in visa processing delays across all categories, including employment-based, family petitions, and other nonimmigrant visas.",
          "exalt_take": "Nilam Shinde’s case exposes a deeper crisis in emergency preparedness for Indian students abroad. It also reveals the bureaucratic bottlenecks that derail real-time help. In crisis moments like these, bureaucratic opacity and lack of coordination can deepen trauma, delay medical care, and damage public trust. Issue statements in solidarity with the victim’s family and assuring the wider Indian American community of quick action. For Democrats, advocate for expansion of humanitarian visa channels, or certain waivers to expedite the visa process during emergency situations. Encourage partnerships between the US State Department and public universities to implement SOPs for international student emergencies, including embassy contacts, mental health triage, and after-hours protocols. Frame faster humanitarian support not as an immigration risk, but as a reaffirmation of American compassion and commitment to global education equity. For Republicans, tie consular efficiency to bilateral security cooperation. Elevate timely consular support for Indian nationals as part of a stronger India-US alliance, especially given India’s centrality in Indo-Pacific and defense partnerships. Push for university accountability and liability by promoting legislation requiring US universities with large international cohorts to maintain minimum emergency preparedness standards and transparent reporting on student safety incidents.",
          "questions_from_community": [
            "Will Nilam Shinde get justice?",
            "Will her family receive the timely support, information, and dignity owed to them while their daughter fights for her life?",
            "Do current US-India consular mechanisms adequately account for medical emergencies or is an overhaul long overdue?",
            "Should universities hosting international students be required to have formalized emergency response plans for incidents involving foreign nationals?",
            "Are delays in emergency visa processing an inevitable consequence of consular backlogs, or a solvable diplomatic blind spot?"
          ],
          "tag": "Student Safety, Emergency Protocols, Visa Issues",
          "section": "WHAT’S HAPPENING IN THE US",
          "posts": {
            "twitter_democratic": "“The tragic case of Nilam Shinde highlights failures in emergency support for international students. We must expand humanitarian visa channels & establish stronger protocols. #StudentSafety”",
            "twitter_republican": "“Nilam Shinde’s death shows why universities must be accountable for emergency preparedness. International students deserve real protection, not red tape. #Accountability”",
            "instagram_facebook_democratic": "The tragic hit-and-run case of Nilam Shinde is not only a personal loss, but also a systemic failure. It exposes bureaucratic bottlenecks that delay critical help and deepen trauma for Indian students abroad. International students bring knowledge, innovation, and billions to our economy. They deserve safety and dignity — not uncertainty in their moments of greatest need. #NilamShinde #USIndia #StudentSafety",
            "instagram_facebook_republican": "The case of Nilam Shinde shines a spotlight on the failures of emergency protocols for international students. Compassion must be backed by accountability. Nilam’s story is a reminder that protecting students means protecting America’s allies. #NilamShinde #USIndia #Accountability"
          },
          "further_reading": [
            "Indian student battles for life in US after hit-and-run accident, family seeks urgent visa",
            "Indian students died in foreign countries- Indian government response In Parliament"
          ],
          "image": "https://images.indianexpress.com/2025/02/Neelam-Shinde-2.jpg?resize=600,338",
          "tweet_id": []
        },
        {
          "_id": "35",
          "title": "Modi, Trump launch US-India COMPACT (Catalyzing Opportunities for Military Partnership, Accelerated Commerce & Technology) for the 21st Century",
          "context": "In a joint press statement at the White House, Prime Minister Narendea Modi and President Donald Trump reaffirmed their commitment to deepening India-US ties across critical domains such as trade, defense, energy, migration, and technology, by launching the US-India COMPACT (Catalyzing Opportunities for Military Partnership, Accelerated Commerce & Technology) for the 21st Century. Tip: Apart from goods trade, Indian students, services exports, and IP royalties generate an estimated $80-85 billion annually for the US. The press briefing was a part of Modi’s visit to Washington D.C., from February 12-13, 2025, his first official US visit since Trump’s return to presidency. Deepening India-US defense ties: India now conducts more military exercises and personnel exchanges with the United States than any other country. Key examples include the high-profile naval drills like Malabar, the army-centric Yudh Abhyas, Vajra Prahar, and the tri-service Tiger Triumph-24. These build interoperability, signalling the two countries’ commitment to “free and open Indo-Pacific” amid China’s regional assertiveness. US is India’s largest defense supplier, with over $24 billion in sales since 2008. The COMPACT initiative aims for further integration of US-origin defense items into India’s inventory, with plans for co-production arrangements for Javelin Anti-Tank Guided Missiles and Stryker Infantry Combat Vehicles in India. The US is also reviewing its policy on releasing fifth-generation fighter jets and undersea systems to India, signaling unprecedented trust. Bilateral Trade: United States is the second largest trade partner for India, by volume, as shown in the pie chart below. A key objective under COMPACT is \"Mission 500,\" an ambitious goal to more than double bilateral trade to $500 billion by 2030. This follows a current trade volume of approximately $191 billion. Both leaders, Modi and Trump, committed to negotiating a mutually beneficial, multi-sector Bilateral Trade Agreement (BTA) by fall of 2025. Growing tech, people-to-people ties: US-India TRUST (Transforming the Relationship Utilizing Strategic Technology) initiative is focussed at close collaboration in critical domains like semiconductors, quantum computing, AI, and space. Moreover, the US-India Strategic Clean Energy Partnership (SCEP) expands joint solar projects and green hydrogen research, crucial for both nations' energy transitions. People-to-people connections are stronger than ever with Indian students now constituting 27 percent of all international students in the US in 2024, totaling 420,000 students and making India the largest source country. This demographic contributes over $11 billion annually to the US economy.",
          "exalt_take": "A deepening India-US relationship across defense, tech, energy, and people, is no longer just evident, it is undeniable. COMPACT is a testimony to the fact that India is central to US strategic interests. From semiconductor supply chains to student mobility, the two countries are more engaged than ever and that interdependence has a growing trajectory. US public office holders must understand that for a majority of Indian Americans, Modi’s leadership is a point of national pride. Acknowledge that sentiment in diaspora outreach to build trust. Engage the Indian-American base by recognizing Modi’s popularity and tapping into the pride many feel in India’s global rise. For Democrats, publicly recognize India’s increasing alignment with US foreign and economic interests. Emphasize the value of Indian talent to US innovation and the soft power gains from a strong, collaborative image. For Republicans, highlight India’s economic weight and critical role in countering China’s dominance. Leverage this to rally support for a trade deal that delivers for US industries.",
          "questions_from_community": [
            "Do you view Prime Minister Modi’s Washington visit as a formal resumption of his dynamic working relationship with President Trump?",
            "To what extent does a change in US administration (from Democrat to Republican) influence the direction or depth of India-US relations?",
            "How do you see India’s growing global stature aligning with long-term US strategic interests?"
          ],
          "tag": "Diplomacy, Defense, Trade, Technology",
          "section": "WHAT’S HAPPENING IN THE US",
          "posts": {
            "twitter_democratic": "“COMPACT shows India is central to U.S. foreign & economic interests. Recognize the role of Indian talent in U.S. innovation and the soft power of our partnership. #USIndia #COMPACT”",
            "twitter_republican": "“India’s economic weight is undeniable — COMPACT is proof the U.S.-India partnership is vital for American jobs, security, and innovation.”",
            "instagram_facebook_democratic": "With the launch of the U.S.-India COMPACT, the partnership between the world’s two largest democracies is stronger than ever. From semiconductor supply chains to student mobility, COMPACT reinforces that India is central to U.S. interests in the 21st century. The Indian-American diaspora sees Modi’s leadership as a source of pride — and acknowledging that sentiment builds trust. #USIndia #COMPACT #Innovation #GlobalPartnership",
            "instagram_facebook_republican": "The new U.S.-India COMPACT is more than an agreement — it’s a strategic realignment. Indian-Americans are proud of India’s global rise. Recognizing that pride is key to building meaningful diaspora outreach while strengthening U.S. security and prosperity. #COMPACT #USIndia #Trade #Security"
          },
          "further_reading": [],
          "image": "https://fintechbiznews.com/cdn/images/BlogPost/Original/133840411637194294.jpg",
          "tweet_id": []
        },
        {
          "_id": "36",
          "title": "Modi meets Musk as part of state visit to US",
          "context": "Prime Minister Narendra Modi met Elon Musk at the Blair House as a part of his official visit to the US in February. The two discussed collaborations across space tech, satellite connectivity, and digital governance. Tip: The Blair House meeting between Modi and Musk was their third formal interaction since 2015. The meeting came amid Starlink’s bid to enter the Indian market, a move closely linked with broader conversations around spectrum regulation and rural internet access. India’s Satcom industry, a lucrative market for Musk’s Starlink: In the Asia-Pacific region, there has been rapid growth in the satellite communications market. India’s satcom sector, which currently stands at US$2.3 billion a year, will reach US$20 billion by 2028. Starlink’s entry into India is seen as unlocking a potential $25 billion market opportunity, with plans to reach around 700 million potential users across rural and underserved regions. Notably, the Indian satellite broadband market has only two players in the satcoms space, OneWeb (in partnership with Bharti Airtel) and Jio Space Technology (a joint venture between Jio Platforms and SES) who have overcome regulatory hurdles. This is an incentive for a new entrant like Starlink to navigate regulatory processes to capture a significant market share and influence market development. How India favors Musk: India made a policy shift by significantly reducing import duties on high-value EVs (above $35,000) from 110 percent to 15 percent by March 2024. This drastic tariff cut, contingent on a $500 million investment and local manufacturing within three years, was to lure global manufacturers, including Tesla, to test the Indian market more affordably before committing to large-scale production. India also permitted 100 percent Foreign Direct Investment (FDI) through the automatic route for manufacturing components and systems for satellites, ground, and user segments, and up to 74 percent FDI via the automatic route for satellite manufacturing and operations. This is in stark contrast with India’s earlier, more restrictive norms, aimed at simplifying entry for private players. In October 2024, in a big win for Musk’s Starlink, India decided to allocate satellite broadband spectrum administratively rather than through an auction, making market entry less costly. This decision highlights the government's intent to attract foreign investment in the satellite communication sector, despite opposition from major domestic telecom players like Reliance Jio and Bharti Airtel.",
          "exalt_take": "The Modi-Musk meeting signals India’s intent to boost foreign investment in strategic tech sectors to facilitate infrastructure transformation. India has positioned itself as a high-potential, low-barrier market for global players like Musk’s Starlink. From slashing EV import duties to allowing 100 percent FDI in satellite services and opting for administrative spectrum allocation, New Delhi is clearing a path for Musk. The Modi government’s strong stance sets India apart in an increasingly crowded global tech race. For Democrats, welcome India’s tech diplomacy and frame regulatory reforms as a model for tech-aligned development in the Global South. Support satellite partnerships that promote equitable access, especially in underserved regions, and recognize India’s role in global digital inclusion goals. For Republicans, highlight India’s move toward open-market access and private-sector partnership as a key opportunity for US companies. Leverage the Modi-Musk moment to encourage broader bilateral agreements on tech and trade infrastructure.",
          "questions_from_community": [
            "How crucial is Starlink entry into the Indian satcom market for the overall US-India relationship?",
            "Do you think the US tech diplomacy should prioritize countries like India that are actively reforming regulation to attract American partnerships?",
            "Is a strong Musk-Modi relationship an indicator of growing US-India ties?"
          ],
          "tag": "Technology, Investment, Diplomacy",
          "section": "WHAT’S HAPPENING IN THE US",
          "posts": {
            "twitter_democratic": "“Modi–Musk signals India’s tech diplomacy in action. Partnerships like Starlink can advance digital inclusion and serve as a model for development across the Global South.”",
            "twitter_republican": "“India’s low-barrier reforms on EVs & satellites = major opportunity for U.S. companies. Modi–Musk shows how the private sector drives growth. #Trade #Tech” OR “India is open for business. Time to strengthen U.S.-India agreements on tech, trade, and infrastructure. #USIndia #MuskModi”",
            "instagram_facebook_democratic": "The Modi–Musk meeting signals India’s ambition to transform infrastructure and expand digital inclusion with policies like lowering EV import duties, allowing 100% FDI in satellite services, and easing spectrum allocation. India is laying the foundation for partnerships that can connect underserved communities and accelerate innovation in the Global South. #USIndia #ModiMusk #DigitalInclusion #TechForAll",
            "instagram_facebook_republican": "The Modi–Musk meeting is more than a handshake — it’s a market signal. India is creating an open-access, private-sector-friendly environment by slashing EV import duties, opening 100% FDI in satellite services and fast-tracking spectrum allocation. #MuskModi #USIndia #TradeOpportunities #TechPartnership"
          },
          "further_reading": [],
          "image": "https://www.hindustantimes.com/ht-img/img/2023/06/21/1600x900/Elon_Musk_meets_PM_Modi_in_New_York_1687316670443_1687316670729.jpeg",
          "tweet_id": []
        },
        {
          "_id": "37",
          "title": "Indian-Americans mobilize against racial bias following DOGE rehiring controversy",
          "context": "In a highly controversial move, Elon Musk, head of the Department of Government Efficiency (DOGE), moved to rehire Marko Elez, a former staffer who had previously resigned after being linked to social media posts calling to “Normalize Indian hate.” Elez had previously worked with Musk at X and SpaceX and was one of two temporary DOGE appointees at the US Treasury who were given access to a highly sensitive Treasury system that processes trillions of dollars in payments annually. The decision, supported by Vice President JD Vance, drew sharp criticism from the Indian-American community. Statement from Indian-American community leaders, diaspora response: Congressman Raja Krishnamoorthi (D-IL), a leading Indian-American voice in Congress, issued a strong statement denouncing the rehiring. He asserted “there should be no place for racism and hate in our government..it is appalling that the Vice President of the United States and one of the president's most prominent advisors would rally behind the rehiring.\" Congressman Ro Khanna (D-CA) also publicly opposed Vice President JD Vance's stance, tweeting at Vance: \"Are you going to tell him to apologize for saying 'Normalize Indian hate' before this rehire? Just asking for the sake of both of our kids.\" This underscored the deeply personal nature of such hateful rhetoric for Indian-American families. Several members of the Indian diaspora expressed anger and disappointment on social media platforms such as X, directly challenging Elon Musk, Vice President JD Vance, and the Trump administration's stance. The community called out the administration’s hypocrisy of defending an individual who advocated \"Normalize Indian hate\" while simultaneously seeking the support of the Indian-American diaspora. Rising hate against Indian Americans in the US: Racist incidents targeting South Asians, within the broader Asian American community, show alarming numbers. A Stop AAPI Hate/NORC survey revealed that 74 percent of young Asian Americans (ages 18–29) experienced a hate act in 2024, with over half (53%) of AAPI adults facing some form of harassment, violence, or discrimination. Anti-Asian slurs surged by 66 percent after the 2024 US election was called, peaking at 87,945 in January 2025. Similarly, online threats of violence reached 973 in August 2024 alone, with 75 percent aimed at South Asians. Data from 2024 shows that 83 percent of Asian American and Pacific Islander (AAPI) adults are concerned about the nation’s racial climate. 82 percent of AAPI adults are optimistic about their communities' power to end racism, and two-thirds (66%) participated in activities to reduce or resist racism. This highlights the community’s strong tendency for collective action and advocacy against biases or discriminatory actions. Indian-Americans, a Democrat-leaning Diaspora: The 2024 Indian American Attitudes Survey (IAAS) by the Carnegie Endowment for International Peace found that a 68 percent majority of Indian American registered voters identify with or lean toward the Democratic Party, compared to 29% for the Republican Party. A significant reason cited by Democrats for not identifying as Republican is the latter's \"intolerance of minorities.\" This strongly suggests that Indian Americans perceive the Democratic Party as being more aligned with their interests on issues of racial tolerance and inclusion. The same 2024 IAAS survey noted that Indian Americans generally hold \"unfavorable views of prominent Republican leaders,\" including those of Indian descent like Nikki Haley and Vivek Ramaswamy, and also Second Lady Usha Vance.",
          "exalt_take": "The numbers tell their own story. The DOGE hiring controversy isn’t just about an individual, it is about the message the administration is willing to send on race and accountability. Hate against South Asians has spiked online and in public spaces, especially since the 2024 election. In this context, the decision to defend Elez feels out of sync with the realities of Indian Americans. The GOP’s decision to rehire Elez and then double down on critics may be one that alienates rather than consolidates support. For Democrats, this controversy offers an opportunity to reinforce their existing support base within the Indian-American community, 68 percent of whom identify with or lean toward the party. Leverage this moment to go beyond symbolism and commit to tangible steps, consistently call out hate including when it comes from powerful tech figures and deepen engagement with younger Indian Americans, who are particularly mobilized by racial justice issues. This is a chance to translate goodwill into sustained political trust. For Republicans, the takeaway is clear that any serious effort to increase Indian-American support cannot coexist with tolerance for anti-Indian rhetoric. While the party has made outreach efforts in recent years, only 29 percent of Indian Americans lean Republican, and episodes like the DOGE rehiring actively erode that small base. GOP leadership must recognize that defending figures associated with hate speech not only alienates Indian-American voters but also weakens the position of Indian-origin Republicans within their own ranks. If the party wants to grow its standing with this community, it must demonstrate a consistent and public commitment to racial respect, not just economic or cultural alignment.",
          "questions_from_community": [
            "Will the Indian-American community get justice?",
            "Will individuals like Vice President JD Vance who occupy such high posts in the government, be held accountable?",
            "Given that the second lady, Usha Vance is Indian-origin, will VP Vance formally apologize?",
            "How do Indian-Americans trust government systems when they reward racist individuals?",
            "Does the government value the community beyond tokenistic representation?"
          ],
          "tag": "Racial Bias, Politics, Indian Diaspora",
          "section": "WHAT’S HAPPENING IN THE US",
          "posts": {
            "twitter_democratic": "“The DOGE rehiring controversy isn’t just about one figure — it’s about the message of race & accountability. Indian Americans deserve better. #StopTheHate”",
            "twitter_republican": "“Defending voices tied to hate speech alienates Indian Americans & weakens Indian-origin Republicans. Outreach must start with respect.”",
            "instagram_facebook_democratic": "The DOGE controversy isn’t just about one person — it’s about what message political leaders send to communities facing racial bias. Since 2024, hate against South Asians has spiked both online and in public spaces. This is a chance to turn goodwill into long-term political trust. #IndianAmericanVoices #StopTheHate #USPolitics",
            "instagram_facebook_republican": "Right now, only 29% of Indian Americans lean Republican. The DOGE rehiring controversy shows why. If the GOP wants to grow its standing with this community, it must show a consistent, public commitment to racial respect — not just economic alignment. #GOPOutreach #IndianAmericanCommunity"
          },
          "further_reading": [],
          "image": "https://i.ytimg.com/vi/iPLRgtzLJvE/hq720.jpg?sqp=-oaymwEhCK4FEIIDSFryq4qpAxMIARUAAAAAGAElAADIQj0AgKJD&rs=AOn4CLA4xDDLFMRlRzayFuZb6JvbJLdXVA",
          "tweet_id": []
        },
        {
          "_id": "38",
          "title": "Over 100 deported Indians land in India via US military aircraft",
          "context": "A US military C‑17 aircraft deported 104 Indian nationals, landing in Amritsar on February 05, 2025. The flight marks the first high-profile operationalization of Trump-era deportation commitments discussed during Prime Minister Modi’s visit to Washington. Tip: India ranked among the top 5 nationalities for US Immigration and Customs Enforcement (ICE) deportation operations in 2024. Some deportees were shackled during transit, with allegations surfacing that several Sikh men were forced to remove their turbans, raising concerns in India over religious rights violations. The incident sparked protests in Punjab and garnered strong condemnation from Sikh organizations. Rising tide of deportations: ICE deported over 271,000 unauthorized immigrants in 2024, a record 10-year high crossing the peak reached during the previous Trump administration. Within this broader context, Indian nationals have become an increasingly prominent demographic in enforcement actions. From 2009 to 2024, a total of 15,756 Indian nationals were deported from the US through various means, with 1,529 deportations occurring in 2024 alone and the number reaching 332 as of February 16, 2025, as shown in the graph above. Indian nationals trying to enter the US without legal authorization increased significantly in the past few years, with a 100-fold rise in the number of Indian immigrants caught while trying to enter the country illegally between 2012 and 2022, as shown in the graph above. US Customs and Border Protection (CBP) confrontations with Indian migrants peaked at nearly 97,000 in 2023, before a slight decrease to approximately 90,000 in 2024. Those arriving illegally embark on perilous routes, sometimes with the aid of human traffickers. Sikh Americans react, demand probe into religious rights’ violations: Population estimates indicate there are 500,000 - 700,000 Punjabi Sikhs in the US, making US the home to one of the largest Sikh diaspora populations across the globe. Although Sikhs make up less than 2 percent of India’s total population, they make up a visible and politically active minority in several US states. California alone is home to over 250,000 Sikh Americans, with the largest concentration living in Yuba City. Often touted as the “Mini Punjab”, the city elected the US’ first Sikh mayor in 2009, and the country’s first female Sikh mayor in 2017. The Shiromani Gurdwara Parbandhak Committee (SGPC), the apex Sikh religious body in India, strongly criticised the US authorities' actions (of alleged forceful turban removal), calling the deportation of Sikhs without their turbans, a \"serious affront to their religious identity.” US-based Sikh advocacy groups such as the Sikh Coalition and the Sikh American Legal Defense and Education Fund (SALDEF), were quick to flag their concerns. SALDEF emphasized that the confiscation or destruction of a Sikh's turban is \"among the gravest offenses imaginable\" and has been a recurring issue at the border since at least 2016.",
          "exalt_take": "The high-profile deportation of Indian nationals, particularly the treatment of Sikh detainees, has sparked a debate around civil liberties, immigration enforcement, and religious freedom. While the United States has ramped up deportations in response to unlawful migration, the alleged violation of religious rights during transit, such as forcing Sikh men to remove their turbans, marks a concerning failure to uphold basic standards of human dignity and international norms. Such reckless enforcement can prove to be alienating for Indian Americans, especially those who identify as Sikh and it is crucial that public office holders reassure them of their safety and right to dignity. Beyond legal implications, it risks deepening distrust between diaspora communities and immigration authorities. For Sikh Americans, the incident may reinforce long-standing grievances over profiling and discrimination in border enforcement, grievances that have historically galvanized civil rights advocacy and political organizing.",
          "questions_from_community": [
            "Will there be an independent investigation into the treatment of deportees on this military flight?",
            "If their religious rights were violated will enforcement authorities be held accountable?",
            "Was the use of shackles and a military aircraft necessary for this operation?",
            "Do you think long processing delays and a crackdown on legitimate pathways to immigration are a reason for increased unlawful immigration?",
            "Amid a crackdown on undocumented migration, what steps are being taken to resolve green card and visa backlogs, especially for Indian applicants facing years-long wait times?",
            "How can India and the US work together to both uphold human rights and discourage dangerous, unauthorized migration routes?"
          ],
          "tag": "Deportation, Immigration, Religious Rights",
          "section": "INDIAN ISSUES",
          "posts": {
            "twitter_democratic": "“Deportation must never mean dignity denied. Forcing Sikh detainees to remove turbans violates religious freedom and human rights. Oversight is urgent.” OR “Indian Americans — especially Sikh Americans — deserve reassurance: their faith and dignity will always be protected in the U.S. #CivilRights”",
            "twitter_republican": "“The use of military aircraft for deportations is standard protocol, not political signaling.”",
            "instagram_facebook_democratic": "The deportation of over 100 Indian nationals, including Sikh detainees allegedly forced to remove their turbans, has sparked deep concerns about religious freedom and civil liberties. No one should have to choose between immigration enforcement and basic human dignity. #ReligiousFreedom #SikhVoices #ImmigrantRights",
            "instagram_facebook_republican": "The deportation of over 100 Indians — including Sikh detainees — has raised important questions. Protecting national security must never be confused with undermining religious freedom. #SecureBorders #ReligiousRespect #USIndia"
          },
          "further_reading": [],
          "image": "https://i.ytimg.com/vi/54IWxdMMpa8/hq720.jpg?sqp=-oaymwEhCK4FEIIDSFryq4qpAxMIARUAAAAAGAElAADIQj0AgKJD&rs=AOn4CLAPF2u4Rt4X9ZcdoBmiAoibEX8Tvg",
          "tweet_id": []
        },
        {
          "_id": "39",
          "title": "India announces Union Budget 2025-26 with continued opportunities for US investment",
          "context": "Finance Minister Nirmala Sitharaman presented India’s Union Budget for the financial year 2025-26, announcing key tariff reductions, incentives for strategic sectors, and new regulatory simplifications continuing along the path of economic liberalization. Tip: US is the 3rd largest investor in India with cumulative FDI inflows of $65.19 billion from April 2000 - March 2024. India slashed peak basic customs duties from 150 percent to 70 percent, and average tariffs to below 11 percent, a signal to trading partners like the US against the backdrop of ongoing trade negotiations with the US, where tariff parity, investment facilitation, and technology cooperation remain key issues. Budget Highlights with US Implications: Tariff Adjustments: Slashed customs duties on EV battery parts and certain capital goods. Notably, basic customs duty for luxury cars, vehicles above $40,000, was reduced from 125 percent to 70 percent, improving market access for US exporters looking to enter the Indian market such as Elon Musk’s Tesla. Insurance Sector: India increased the Foreign Direct Investment (FDI) limit in the insurance sector from 74 percent to 100 percent for companies investing the entire premium in India. This, along with proposed compliance easing, creates significant opportunities for US firms. Green Technology and Artificial Intelligence: This year, approximately $72 million has been allocated to the National Green Hydrogen Mission, more than double the previous year's allocation. The budget for semiconductor development surged by 83 percent to about $840 million . Additionally, approximately $60 million is dedicated to an AI Centre of Excellence in Education and other AI research hubs. Both green tech and AI are sectors where excessive US-India tech collaboration is already underway. Tax Roadmap: While no major alterations were made to the direct tax structure, the government announced its intent to simplify personal and corporate tax regimes by 2026. The rebate under Section 87A was increased, that is, individuals with annual incomes up to ₹12 lakh (~$14,300) will have no tax liability. This simplification is a long-standing demand of US investors.",
          "exalt_take": "India’s 2025-26 budget reasserts its commitment to liberalization and macroeconomic discipline. The expansion of FDI in insurance and moving towards tariff parity sends a clear signal in favor of US investors. For Democrats, recognize India’s move as a show of good faith and trust, support enhanced US-India collaboration and tariff cuts as a step towards enforceable trade norms, particularly in digital trade and environmental goods. For Republicans, welcome the tariff cuts as a positive outcome of the diplomacy between Modi and Trump administrations. Frame these reforms as proof that pressure works, but keep focus on reciprocal access to ensure US exports see parity and you do not alienate the Indian diaspora.",
          "questions_from_community": [
            "Do you think these tariff cuts signal a stronger trade alignment between India and the US?",
            "Should the US press for faster removal of Agriculture Infrastructure Development Cess (AIDC) in negotiations?"
          ],
          "tag": "Economy, Investment, Budget",
          "section": "INDIAN ISSUES",
          "posts": {
            "twitter_democratic": "“India’s 2025-26 Budget expands FDI + moves toward tariff parity — a clear signal of trust. Let’s deepen US-India collaboration on digital trade & green goods.”",
            "twitter_republican": "“India’s tariff cuts? A direct result of tough diplomacy between Trump & Modi. Pressure delivers.”",
            "instagram_facebook_democratic": "India’s Union Budget 2025-26 signals liberalization + trust in global markets. With expanded FDI in insurance and moves toward tariff parity, the reforms mark an opportunity for US-India economic partnership to grow stronger. Global trade can be a force for equity — and this Budget is proof that India wants to partner with the US to make it happen. #USIndia #TradePartnership #GreenEconomy",
            "instagram_facebook_republican": "India’s 2025-26 Budget delivers tariff cuts + FDI expansion — proof that US diplomacy works. A strong India is a strong partner. But we must keep the balance fair. #Trade #Reciprocity #USIndia"
          },
          "further_reading": [],
          "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSIJk2bPj_CPjQ6Pu26B0giv4q58cwUwM1i-g&s",
          "tweet_id": []
        },
        {
          "_id": "40",
          "title": "India lowers tariffs on bourbon whisky, amid trade deal negotiations with the US",
          "context": "On February 14, 2025, India revised its import tariffs on bourbon whisky, announcing a significant reduction amidst criticism from the Trump administration regarding trade barriers as negotiations for a long-term India-US trade deal continued. Tip: India had imposed a 150% import duty on American whiskey for years, one of the highest in the world. The new rate brings it down to 100% for a set quota of imports. India’s booming spirits market and whisky trade with US: India is the world's third-largest alcohol market overall and the second largest for spirits. It is also the world's largest whisky market by volume. The Indian whisky market valued at $19.16 billion in 2024, is projected to reach a mammoth $48.65 billion by 2030, at a substantial compound annual growth rate. In 2024, US whiskey exports to India reached approximately US$8.8 million, a figure that is expected to grow multifolds after the recent tariff reductions. The tariff cut creates an opportunity for US distillers to better compete in India's growing premium whisky market, where increasing middle-class demand and changing tastes could boost brands like Jack Daniel’s and Jim Beam. India-US Trade: Bilateral goods trade totalled around $129.2 billion in 2024, with US goods imports from India being $87.4 billion and US goods exports to India at $41.8 billion. The total US goods trade deficit with India was approximately $45.7 billion, a strong point of contention for the US. India's high tariffs on agricultural products, medical devices, automobiles, and information and communications technology (ICT) products have all been points of concern for the US. Also, the US has expressed disagreement over India’s non-tariff barriers and intellectual property rights.",
          "exalt_take": "India’s announcement to slash tariffs on bourbon whisky is a broader strategic shift in its approach to US trade negotiations. But several underlying issues remain before a long-term trade agreement can be reached. As the US continues to press for deeper reforms on agriculture, digital trade, and regulatory transparency, it is important to publicly welcome the bourbon gesture as a diplomatic victory. Underscore the importance of a mutually beneficial trade deal and recognize India’s role as a strategic trade partner. India’s economic interests are a direct source of diaspora pride who have deep personal connections with the country’s growth, and largely favor the Modi government. Bear these stakes in mind while addressing any issues around the trade deal and refrain from harsh language against India even while discussing points of contention with the US.",
          "questions_from_community": [
            "Do you see India’s bourbon tariff reduction as a friendly gesture?",
            "Will India and the US be able to finalize a trade agreement by the set deadline?",
            "Do you agree with President Trump’s rhetoric that India is a “trade abuser”?"
          ],
          "tag": "Trade, Tariffs, Economy",
          "section": "INDIAN ISSUES",
          "posts": {
            "twitter_democratic": "“India’s decision to slash tariffs on bourbon whisky may sound symbolic, but it’s a crucial gesture in ongoing US-India trade talks. = Celebrating bourbon today means pushing for climate goods & fair trade rules tomorrow. #USIndia #TradePartnership #Diplomacy",
            "twitter_republican": "Tariffs on bourbon whisky are down — proof that tough US-India negotiations are working. Small win. Bigger fight ahead. #TradeDeal #USIndia #Reciprocity",
            "instagram_facebook_democratic": "India’s decision to slash tariffs on bourbon whisky may sound symbolic, but it’s a crucial gesture in ongoing US-India trade talks. This isn’t just about gas — it’s about building climate-aligned industrial partnerships for the future. #CleanEnergyDiplomacy #USIndia #EnergyTransition #ClimateAction #SouthAsianVoices #NetZeroPartnership",
            "instagram_facebook_republican": "India’s LNG tax deliberations mark a win for American energy producers and US jobs. Strong energy ties mean stronger US leadership abroad and economic strength at home. #AmericanEnergy #USIndia #Jobs #IndoPacific #EnergySecurity #FairTrade #SouthAsianVoices"
          },
          "further_reading": [],
          "image": "https://framerusercontent.com/images/O7ZtGcDZPvwiQNwjLSVMdsmP2ok.jpg?scale-down-to=1024",
          "tweet_id": []
        },
        {
          "_id": "41",
          "title": "India and Israel convene high-level business forums to deepen economic ties",
          "context": "India and Israel hosted two high-level business conventions, the India-Israel Business and CEO Forums on February 11, 2025 in bid to deepen economic ties. While the two countries already have strong defense cooperation, the discussions at the forum spanned artificial intelligence, smart manufacturing, cybersecurity, and clean energy. Tip: India is Israel's second-largest trade partner in Asia and seventh largest globally. Israel's Minister of Economy Nir Barkat noted that the Israeli business delegation in New Delhi was the largest ever mission from Israel to any country, highlighting the high priority placed on this relationship. India-Israel Bilateral Ties: Bilateral non‑defense trade between India and Israel totalled US $6.53 billion in 2023-24. India is Israel’s second‑largest trading partner in Asia, and continues to dominate exports in petrochemicals, machinery, electrical goods, and agricultural tech. As shown by the graph above, Israel is a strategic defense partner for India. Arms exports from Israel to India surged from $5.6 million in 2015 to $185 million in 2024, a thirty‑fold jump. Between 2020-2024, India accounted for over 34 percent of Israel's total arms exports, making India the largest recipient of Israeli arms. During the forums, Israeli minister Barkat emphasized two main objectives- boosting collaboration opportunities for Israeli companies in India and identifying how both governments can deepen the ties, including potential of the India-Middle East-Europe Economic Corridor (IMEEC). Geopolitical ramifications of strong India-Israel ties: A growing bilateral relationship between India and Israel is in direct alignment with US interests for several reasons. The US is the largest arms supplier to Israel, accounting for over 65 percent of Israel's major conventional arms imports between 2013 and 2023, as shown in the pie chart below. Israel is also the biggest and most steadfast US ally in the Middle East, particularly as a counterbalance to Iranian influence. The trilateral dynamic between India-US-Israel is strengthened by initiatives like the I2U2 grouping (India, Israel, UAE, and USA) and the India-Middle East-Europe Economic Corridor (IMEEC). Such platforms facilitate economic integration and connectivity, provide alternatives to rival initiatives and create a more US-aligned regional architecture in the Middle East. Indian-Americans’ stance on Israel-Palestine conflict and strengthening ties with Israel: According to a survey by the Carnegie Endowment, the Indian-American diaspora sympathizes equally with Israel and Palestine in the conflict. 29 percent sympathize mostly or entirely with Israel and 35 percent sympathize mostly or entirely with Palestine. Nearly 24 percent of the Indian-American demographic sympathize equally with both.",
          "exalt_take": "Both parties in the US should recognize robust India-Israel ties as a gain for long-term strategic alignment, especially as Washington aims to root its Middle East policy in partnerships beyond defense ties. Public office holders must welcome the developments aimed at deepening bilateral ties between India and Israel by acknowledging both as vital allies in the Indo-Pacific and Middle-East, respectively. For Democrats, the focus should be on ensuring that deepening economic ties are accompanied by human rights transparency and regional stability, particularly given diaspora sensitivities around the Israel-Palestine conflict. For Republicans, the India-Israel-US trilateral represents a strong case for pushing back against adversarial influence in the Indo-Pacific and Middle East alike. It is also a moment to advocate for enhanced trilateral collaboration. Indian Americans remain divided in their sympathies on the Israel-Palestine issue, but show broad support for technological, innovation-led collaboration, underscoring that deeper bilateral ties need not contradict pluralistic values, if pursued with clarity, diplomacy, and an eye toward peace.",
          "questions_from_community": [
            "Do you support India deepening its trade and tech ties with Israel despite ongoing tensions in the Middle East?",
            "Do you believe trilateral cooperation among India, Israel, and the US can serve as a credible counterweight to Chinese or Iranian influence?"
          ],
          "tag": "Diplomacy, Economy, Middle East",
          "section": "INDIAN ISSUES",
          "posts": {
            "twitter_democratic": "“India-Israel economic ties are deepening. The US should welcome this — while insisting growth comes with human rights transparency & regional stability”",
            "twitter_republican": "“India + Israel = two trusted allies. Strengthening their ties strengthens the case for trilateral US-India-Israel cooperation against adversarial influence”",
            "instagram_facebook_democratic": "India and Israel are deepening business ties — and the US should welcome this development. Indian Americans support tech & innovation collaborations, but clarity and transparency are essential. #IndiaIsrael #USIndia #HumanRights #Innovation",
            "instagram_facebook_republican": "India and Israel is a powerful partnership. The India-Israel-US trilateral is more than business. For Republicans, this is a moment to double down on calls for enhanced trilateral cooperation. #IndiaIsrael #StrategicAllies #USLeadership"
          },
          "further_reading": [],
          "image": "https://etimg.etb2bimg.com/photo/118132140.cms",
          "tweet_id": []
        }
      ]
    },
    "march": {
      "exalt_summary": "This brief covers major developments that impacted the Indian diaspora and US-India relations in March 2025. We begin by addressing the concerning rise of anti-Hindu incidents in the US, with a specific focus on the vandalism of a Hindu temple in Chino Hills, California. This event, which occurred just days before a planned \"Khalistan Referendum\" event nearby, prompted Indian-American lawmakers to formally request a Department of Justice briefing on the issue. Next we cover another hate crime against the Indian-American community wherein an Indian-American nurse was brutally attacked in Florida, highlighting the xenophobia and vulnerability faced by Indian professionals in frontline roles. The brief also explores the latest in US-India bilateral relations. The US urged India to accept F-35 fighter jets and lower import tariffs as part of a new trade deal. In a reciprocal move, India offered tariff cuts on over $23 billion of US goods,including a potential elimination of the import tax on US liquefied natural gas (LNG), a move that would strengthen energy cooperation between the two nations. Finally, we cover India's victory in the ICC Champions Trophy, an event that was widely celebrated by the Indian diaspora in the US and drew renewed attention to the cultural and commercial significance of cricket in America. We note the increasing investments in Major League Cricket (MLC) and the sport's growing political relevance ahead of its debut in the 2028 Los Angeles Olympics.",
      "details": [
        {
          "_id": "42",
          "title": "Hindu temple in California vandalized amid increasing anti-Hindu incidents in US",
          "context": "The BAPS Shri Swaminarayan Mandir in Chino Hills, California, was vandalised on March 08, 2025 with anti-India and anti-Hindu graffiti, including slogans like “Hindustan Murdabad” (Death to India) and anti-Modi references. The incident, a suspected hate crime, marks the most recent in a spate of temple vandalism cases across the US. Tip: At least ten acts of vandalism targeting Hindu temples have been reported since 2022 in the United States alone, with seven of these occurring in California. Prominent Indian-American lawmakers, including Reps. Ro Khanna, Pramila Jayapal, Raja Krishnamoorthi, Ami Bera, and Shri Thanedar, formally requested a Department of Justice (DOJ) briefing, citing growing anxiety among Indian Americans and an alarming rise in targeted hate. Scope of BAPS temples in the US: BAPS is part of a network of over 1,300 temples and 5,025 centers worldwide, with 106 temples across 34 US states and 97 congressional districts (see map below), attracting over 2.5 million annual visitors. Of BAPS’s traditional stone-carved mandirs, five marquee temples are located in Houston, Chicago, Atlanta, Los Angeles, and with the Swaminarayan Akshardham in Robbinsville, New Jersey being the largest Hindu temple outside India. Rising anti-Hindu hate in the US: At least six anti-Hindu vandalism incidents have been reported at BAPS temples specifically in California and New York, since December 2023. These incidents have often involved graffiti with Khalistan slogans and insulting references to the Indian government. After the incident, BAPS Public Affairs released a statement underscoring the community's resilience in the face of such adversity: Beyond BAPS, there were 32 reported anti-Hindu hate crimes in 2023. The Khalistan Issue: The graffiti found on vandalized Hindu temples, including the BAPS Mandir in Chino Hills, has politically charged messaging related to \"Khalistan,\" a separatist movement advocating for the creation of an independent, ethno-religious Sikh state called Khalistan (meaning 'land of the Khalsa') in the Punjab region of India. ‘Khalistan’ continues to garner some sympathy and support among a section of the Sikh diaspora, particularly in countries like Canada, the UK, the US, and Australia. This diaspora support often involves fundraising and advocacy for a referendum, notably by organizations like Sikhs for Justice (SFJ), which India has designated as a terrorist organization and banned. Crucially, the Chino Hills temple vandalism on March 8, occurred just days before a planned \"Khalistan Referendum\" event by SFJ in Anaheim, California, on March 10, 2025.",
          "exalt_take": "The vandalism of the BAPS Shri Swaminarayan Mandir in Chino Hills is part of a broader and deeply concerning trend of targeted attacks against Hindu places of worship in the United States. With over 100 BAPS temples spread across 34 states, many serving as community anchors, these incidents are not isolated acts of defacing temples, they are threats to diaspora identity, religious expression, and public safety. That this act came just days before a “Khalistan Referendum” in nearby Anaheim raises serious questions about coordination, intent, and potential escalation. Indian-American lawmakers’ formal request for a DOJ briefing signals that these are no longer niche community concerns but now issues of national policy and domestic counter-extremism. US public office holders must condemn the incident and issue statements of solidarity with Hindus in the US. For Democrats - also advocate for federal protections of religious minorities by expanding DOJ tracking and prosecution of hate crimes targeting Hindu temples and other South Asian faith institutions. Voice support and facilitate the establishment of a Congressional Task Force on South Asian American Civil Rights to provide oversight and build trust with affected communities. Ensure hate crime data disaggregation includes anti-Hindu incidents. For Republicans- affirm the party’s commitment to religious freedom and law and order by condemning targeted attacks on houses of worship and supporting stronger FBI coordination with local law enforcement on diaspora-linked extremism. Back legislation that enhances security funding for temples and cultural centers, aligning with broader concerns about domestic radicalization and foreign influence.",
          "questions_from_community": [
            "Will Hindus get justice in this case, and will the perpetrators of the Chino Hills temple vandalism be held accountable under federal hate crime statutes?",
            "How can the religious freedom of Hindu Americans and other South Asian minorities be better protected in the US?",
            "Are current hate crime tracking systems equipped to capture rising anti-Hindu incidents with enough specificity?",
            "What steps can local and federal law enforcement take to address diaspora-linked extremism, including anti-India rhetoric tied to the Khalistan movement?"
          ],
          "tag": "Hate Crimes, Religious Freedom, Indian Diaspora",
          "section": "WHAT’S HAPPENING IN THE US",
          "posts": {
            "twitter_democratic": "“The vandalism of the BAPS temple in Chino Hills is not just an isolated act. It’s part of a broader trend targeting Hindu places of worship across the US.” OR “Democrats must push for expanded DOJ tracking of hate crimes, protections for South Asian faith institutions, and a Congressional Task Force on South Asian Civil Rights.”",
            "twitter_republican": "“Republicans should back stronger FBI-local coordination and enhanced security funding for temples, aligning with law and order priorities.”",
            "instagram_facebook_democratic": "The recent vandalism of the BAPS Shri Swaminarayan Mandir in Chino Hills is part of a disturbing pattern of attacks against Hindu temples. With over 100 BAPS temples serving as cultural and community anchors nationwide, these incidents strike at the heart of diaspora identity and safety. Safety, dignity, and religious freedom for all communities must remain a top priority. #SouthAsianVoices #StopHate #ReligiousFreedom #CivilRights #IndianAmerican #HinduAmerican #CommunitySafety",
            "instagram_facebook_republican": "The vandalism of the Chino Hills BAPS temple is not just a local issue — it is a matter of religious freedom and security. A strong America protects its houses of worship and defends every community’s right to faith and safety. #ReligiousFreedom #LawAndOrder #CommunitySafety #SouthAsianAmericans #HinduAmerican #FaithFreedom #StopHate"
          },
          "further_reading": [],
          "image": "https://i.ytimg.com/vi/rVa4P_LUmlg/hq720.jpg?sqp=-oaymwEhCK4FEIIDSFryq4qpAxMIARUAAAAAGAElAADIQj0AgKJD&rs=AOn4CLCo96pd6_qNJQ0s25fAmkPRYGyWwg",
          "tweet_id": []
        },
        {
          "_id": "43",
          "title": "Indian-Origin nurse brutally attacked in a hate crime in Florida",
          "context": "Leelamma Lal, a 67-year-old Indian-American nurse, was brutally assaulted at HCA Florida Palms West Hospital by a patient who reportedly yelled, “Indians are bad” while attacking her. Tip: In 2023, Florida reported 311 hate crimes, a 36-percent increase since 2022. Of the reported incidents, 38 percent were motivated by the victim's race/color, making it the largest category of bias motivation in the state. Lal sustained severe injuries to her face and back. The attacker, 45-year-old Nicholas Schock, was arrested and charged with aggravated battery of an elderly person and hate crime. Indian healthcare workers in the US: Indians make up an estimated 8% of all physicians in the US, with India being the top source country for immigrant doctors (as shown by the chart below). Likewise, over 80,000 nurses in the US are of Indian origin. According to the US Bureau of Labor Statistics, 75 percent of all workplace assaults in the US occur in healthcare settings with nurses being the most frequent target. Considering the large number of Indian-origin health workers, the Florida incident has raised serious concerns about the safety of the Indian diaspora in such settings, and overall amid a spate of hate crimes. Rising hate crimes in the US: Anti-Asian hate crimes in the US increased by over 339 percent from 2020 to 2021 and have remained elevated, with South Asians among frequent targets. The 2023 data for hate crimes motivated by race is shown below: With an increasing Indian-American population, now over 5 million nationwide, the persistence of racially motivated hate crimes underscores the urgent need for stronger legal protections, workplace safety measures, and public accountability.",
          "exalt_take": "The brutal attack on Leelamma Lal highlights the prevalent racism, xenophobia, and occupational vulnerability. While hate crimes against Asian Americans surged in recent years, assaults targeting Indian-American healthcare workers reflect a growing pattern that demands urgent attention. As Indian professionals continue to serve disproportionately in frontline roles from hospitals to tech, their visibility also makes them targets. Such instances must not be seen as isolated acts of violence as a picture of bias and hate in society. Meaningful justice requires more than arrests, it demands enforcement of hate crime statutes, workplace safety reforms, and visible solidarity from both political and industry leaders. For Democrats, push for federal oversight and enforcement of hate crime statutes, especially in states with rising incidents like Florida. Encourage the DOJ to audit state-level responses for consistency and accountability. Introduce, expand and support workplace safety legislation for healthcare settings, including specific protections for immigrant and minority staff. Host public town halls with South Asian healthcare professionals to raise visibility around their experiences and influence future policy responses. For Republicans, support bipartisan measures to strengthen penalties for hate-motivated violence, especially against elderly and frontline workers. Condemn racially motivated violence publicly, signaling that such acts contradict American values of law, order, and respect for public service. This is a moment for leaders across the aisle to reaffirm that immigrant communities are not only integral to the American fabric but also entitled to equal protection under law.",
          "questions_from_community": [
            "Will Leelamma Lal and her family receive justice?",
            "How will the perpetrator be held accountable and will the hate crime enhancement actually lead to a harsher sentence?",
            "What protections currently exist for immigrant healthcare workers facing workplace violence?",
            "Do you believe there is a need for harsher statutes against hate crimes?",
            "What measures can be undertaken to ensure more hate crimes are reported?"
          ],
          "tag": "Hate Crimes, Workplace Safety, Healthcare",
          "section": "WHAT’S HAPPENING IN THE US",
          "posts": {
            "twitter_democratic": "“The brutal attack on Leelamma Lal underscores a disturbing rise in hate crimes against Indian-American healthcare workers. Democrats must push for stronger federal enforcement of hate crime statutes, workplace safety reforms, and solidarity with frontline immigrant workers.”",
            "twitter_republican": "“Violence against Indian-American healthcare workers is unacceptable. Republicans should lead in strengthening penalties for hate crimes, standing with elderly and frontline workers, and affirming that such acts contradict America’s values of law and order.”",
            "instagram_facebook_democratic": "The brutal attack on Leelamma Lal in Florida is not an isolated act — it reflects a disturbing rise in hate crimes targeting Indian-American healthcare workers. Indian-American frontline workers deserve safety, dignity, and justice. #SouthAsianVoices #StopHate #HealthcareHeroes #CivilRights #IndianAmerican #JusticeForLeelamma #CommunitySafety",
            "instagram_facebook_republican": "The attack on Indian-origin nurse Leelamma Lal highlights an urgent challenge: protecting elderly and frontline workers from hate-driven violence. A strong America is one where violence and hate are never tolerated. #LawAndOrder #Justice #StopHate #ReligiousFreedom #CommunitySafety #IndianAmerican #HealthcareWorkers"
          },
          "further_reading": [],
          "image": "https://c.ndtvimg.com/2025-03/90f8vdvg_indian-nurse-x_625x300_04_March_25.jpeg",
          "tweet_id": []
        },
        {
          "_id": "44",
          "title": "US Implores India to accept F‑35 jets, reduce import tariffs",
          "context": "US Commerce Secretary Howard Lutnick urged India to slash import tariffs and increase its defense procurement from US suppliers, including F‑35 stealth jets, for a new, mutually beneficial trade deal. Tip: India accounted for around $36 billion dollars worth of arms imports, accounting for about 10 percent of global arms imports from 2008 to 2024, making it the top importer worldwide. India-US defense ties: Since 2008, India has committed to purchasing over US $20 billion in US-made defense equipment, including drones and transport helicopters. Washington has now tied defense sales to broader tariff cuts in a fresh bid towards a long-term trade deal between India and the US. As shown in the data above, India is only second to Ukraine in terms of arms imports between 2020 and 2024, with Russia as its largest supplier, an influence the US seeks to counterbalance. With the recent global political climate, defense trade is no longer an exchange of arms, but a strong indicator of shifting alliances, deepening trust between countries, and the latest US offer of F-35 jets underscores how crucial India-US partnership is. India’s search for a fifth generation fighter jet: India is faced with an urgent need for a fifth-gen fighter jet as regional rivals advance their stealth capabilities. China has already inducted over 150 J-20 stealth fighters across multiple airbases in its Western Theatre Command, with Pakistan expected to receive JF-17 Block III fighters with limited stealth features and AESA radars by 2026. In contrast, India currently lacks any fifth-generation aircraft in its inventory, with its most advanced jets, the French-origin Rafale and the Russian Su-30MKI, classified as 4.5 generation fighters. India's indigenous fifth-generation fighter effort, Advanced Medium Combat Aircraft (AMCA) program, is progressing with a projected first flight by late 2028 and operational capability by 2035. The Cabinet Committee on Security approved $1.8 billion in March 2024 for its Full-Scale Engineering Development, including five prototypes, while engine sourcing discussions continue with Safran (France) and GE (US). To bridge the gap in the meanwhile, Russia offered the Su-57E with local production and US officials have now \"float-ed the idea\" of F-35 sales, though no formal offer has been made. India's reluctance to accept Russia’s offer stems from the Su-57’s perceived troubled development and concerns over future sanctions under CAATSA (Countering America's Adversaries Through Sanctions Act) given India's existing defense ties with Russia. India was presented F-35 models at Aero India 2023, and Lockheed Martin has actively promoted the jet's interoperability with Quad forces. However, acquisition would require sweeping doctrinal shifts, significant infrastructure upgrades, and formal alignment with US end-use monitoring protocols.",
          "exalt_take": "This moment represents a high-stakes alignment of India's modernization, US foreign interests, and regional geopolitics, all in the backdrop of an impending trade deal between New Delhi and Washington. Securing US defense equipment, particularly the F-35 stealth jets, is a qualitative leap for the Indian military. But signing on is neither easy, nor straightforward. India must balance its “Make in India” drive, tariff protection for nascent sectors, and strategic autonomy alongside deeper US engagement. For US public office holders, it is important to note that the majority of the Indian diaspora in the US favors the Modi government and their initiatives like ‘Make in India.’ Any developments in the trade and defense landscape are being closely followed by the community, which necessitates all communication from public leaders to acknowledge India’s growing stature globally if they are to meaningfully engage with Indians in the US. For Democrats, express support for a shared US-India defense industrial roadmap under initiatives like INDUS‑X and the Defense Tech and Trade Initiative. Also advocate for technology transfers and compliance clauses to accompany major defense contracts, especially in areas like cybersecurity, AI-enabled systems, and aircraft maintenance. For Republicans, frame increased defense sales as a key deliverable of strong bilateral pressure. Push for legally binding purchase commitments as part of any trade deal, tying Indian defense purchases to tariff relief for US exporters.",
          "questions_from_community": [
            "Do you think defense ties should be used as a pawn in trade deal negotiations with India?",
            "Would a US-India joint production deal on fighter jets strengthen bilateral trust and domestic manufacturing?",
            "Is deepening defense ties with India the best way to counterbalance China in the Indo-Pacific?"
          ],
          "tag": "Defense, Trade, F-35",
          "section": "WHAT’S HAPPENING IN THE US",
          "posts": {
            "twitter_democratic": "“India’s modernization presents an opportunity for a shared US-India defense industrial roadmap. Democrats should advocate for tech transfers, compliance clauses, and collaboration under INDUS-X to strengthen trust while advancing cybersecurity, AI, and aircraft maintenance.”",
            "twitter_republican": "“F-35 sales to India should be tied to results. Republicans can frame defense deals as proof that strong US pressure works — push for legally binding purchase commitments and link them to tariff relief for US exporters.”",
            "instagram_facebook_democratic": "India’s consideration of the F-35 jets is about more than equipment — it’s about charting a shared defense future. India’s “Make in India” goals can align with US innovation — if both sides commit to long-term, tech-driven defense cooperation. #USIndia #DefenseTech #MakeInIndia #INDUSX #SecurityPartnership #SouthAsianVoices #InnovationDiplomacy",
            "instagram_facebook_republican": "The F-35 conversation with India is a chance to secure results for America. A stronger India means a stronger Indo-Pacific — and a win for US industries and workers. #AmericaFirst #USIndia #DefenseDeals #FairTrade #MakeInIndia #SecurityPartnership #IndoPacific"
          },
          "further_reading": [],
          "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQPet8AtQbsx9NZsxv4tkgVTsVEikqVU1CE-Q&s",
          "tweet_id": []
        },
        {
          "_id": "45",
          "title": "India deliberates US LNG import tax removal",
          "context": "With the trade deal negotiation between India and the US underway, India is considering eliminating its 2.75 percent tax on US liquefied natural gas (LNG) - a 2.5 percent basic customs duty plus 0.25 percent social welfare surcharge. Tip: India's natural gas demand is set for a 60 percent rise by 2030 which may double its LNG imports. A tax removal on US LNG imports would boost the competitiveness of US LNG in India, considering that LNG imports from UAE and Australia are already exempt under bilateral agreements, creating a pricing advantage for those sources. India-US LNG Trade: The Asia-Pacific region was the largest importer of LNG across the world in 2024, led by India and China. India is the world’s 4th largest LNG importer, relying on imports for roughly 50 percent of its natural gas consumption. India imported approximately 27.79 billion cubic meters (bcm) of LNG in 2024. The US supplied over 5.4 bcm of LNG to India in 2024 (about 18.5 percent, as shown below), maintaining its position as India’s second-largest LNG partner after Qatar. LNG cooperation aligns with India's goals under its \"Gas-Based Economy\" initiative and net-zero by 2070 pledge. For the US, it supports energy security diplomacy and strengthens economic ties with a key Indo-Pacific partner. In 2024, the total goods trade between the United States and India was an estimated $129.2 billion. With US LNG exports to India valued at approximately $2.54 billion in 2024, LNG constituted approximately 2 percent of the total bilateral goods trade.",
          "exalt_take": "The potential removal of India’s import tax on US LNG is an opportunity to strengthen bilateral energy cooperation. For India, it supports efforts to diversify energy sources, secure long-term supply at competitive rates, and meet climate goals. For the US, it boosts a key export sector while reinforcing strategic ties in the Indo-Pacific. This development also signals momentum in the broader India-US trade conversation where energy, defense, and digital sectors are increasingly intertwined. As US LNG becomes more accessible in India, there is scope to build durable supply chains and infrastructure partnerships. For Democrats, frame LNG trade as part of the Biden administration’s clean energy diplomacy and climate-aligned industrial strategy. Advocate for investment in Indo-US energy infrastructure that supports net-zero transitions on both ends. For Republicans, emphasize the deal as a win for American energy producers and job creation in the Gulf Coast. Support LNG exports as a counterweight to Russian and Chinese energy influence in Asia. Leverage this momentum to push for broader market access in India for US goods and services.",
          "questions_from_community": [
            "Do you believe that the US should condition LNG export deals on strategic alignment like India's stance on Russia or China?",
            "Do you believe that LNG trade will become a stepping stone for deeper Indo-US climate collaboration?"
          ],
          "tag": "Energy, Trade, LNG",
          "section": "INDIAN ISSUES",
          "posts": {
            "twitter_democratic": "“US-India LNG cooperation is more than trade — it’s about clean energy diplomacy. Democrats should tie this moment to Biden’s climate-aligned industrial strategy, advocating for investment in net-zero energy infrastructure on both ends.”",
            "twitter_republican": "“India’s removal of LNG import taxes would be a win for American energy producers. Republicans can frame this as job creation for the Gulf Coast & a way to counter Russian/Chinese energy influence in Asia.”",
            "instagram_facebook_democratic": "The potential removal of India’s LNG import tax opens a new chapter for US-India clean energy cooperation. This isn’t just about gas — it’s about building climate-aligned industrial partnerships for the future. #CleanEnergyDiplomacy #USIndia #EnergyTransition #ClimateAction #SouthAsianVoices #NetZeroPartnership",
            "instagram_facebook_republican": "India’s LNG tax deliberations mark a win for American energy producers and US jobs. Strong energy ties mean stronger US leadership abroad and economic strength at home. #AmericanEnergy #USIndia #Jobs #IndoPacific #EnergySecurity #FairTrade #SouthAsianVoices"
          },
          "further_reading": [],
          "image": "https://newsarenaindia.com/_next/image?url=https%3A%2F%2Fimages.newsarenaindia.com%2F%2Funtitled-design-20250328t161752884jpg_1743158992323.jpg&w=1920&q=75",
          "tweet_id": []
        },
        {
          "_id": "46",
          "title": "India wins ICC Champions Trophy",
          "context": "India won their third ICC Champions Trophy title by defeating New Zealand in a closely contested final at the Dubai International Cricket Stadium in UAE. The victory came after an undefeated run for Team India throughout the tournament. Tip: The US hosted its first ICC Men’s T20 World Cup matches in June 2024, drawing record-breaking diaspora attendance in stadiums like New York’s Nassau County International Cricket Stadium. Diaspora communities across the United States marked the win with watch parties, social media campaigns, and local celebrations, bringing renewed attention to cricket’s cultural and commercial relevance in the US. Cricket in India: Cricket is often hailed as the largest religion in India, owing to its widespread popularity and the power to unite the masses. The ICC Champions Trophy final in March 2025, peaked at 61 million viewers on streaming platform JioHotstar. The Board of Control for Cricket in India (BCCI) reported a record revenue of approximately $1.17 billion in 2023-24. Apart from a direct stream of revenue, cricket creates employment across broadcasting, sponsorship, merchandising, and tourism. The ICC Men’s Cricket ODI World Cup in 2023 alone created over 48,000 jobs in hospitality, event management, and other sectors. The event also drew in scores of international tourists, with top venues experiencing surges in airfare and hotel prices. India's sports tourism sector, largely driven by cricket, was valued at approximately $38.7 billion USD in 2023 and is projected to surge to $133.4 billion USD by 2030. Cricket in the US: According to Nielsen data from a 2025 Global Sports Report, 12.8 percent of Americans are cricket fans. Another estimate suggests that over 63 million Americans follow cricket events, including through diasporic connections. The 2024 ICC Men’s T20 World Cup was hosted by the US and West Indies with matches held in New York's Nassau County International Cricket Stadium. The India-Pakistan clash saw capacity crowds of over 34,000 fans waving both Indian and American flags. Many fans donned India jerseys alongside US flags, signaling a hybrid patriotism that highlighted the sport's growing cultural footprint in the US. Cricket is also set to return to the Olympic Games in Los Angeles 2028 after a 128-year absence. Cricket investments in the US: Major League Cricket (MLC) has secured a massive investment of $120 million for building or renovating cricket stadiums, training centers, and broadcast infrastructure across the US. Most of this financial support has come from India-origin tech and business leaders including Microsoft CEO Satya Nadella. MLC plans substantial investments across venue developments, with specific projects including: Grand Prairie Stadium, Texas: approximately $20 million (redevelopment) to expand capacity from 7,200 to 15,000-20,000. Church Street Park, North Carolina: Multi-million dollar partnership (over $3M in upgrades announced in 2022) to increase capacity to over 3,500. West Coast venues (e.g., Silicon Valley, Seattle, Los Angeles): Significant future investments are planned, with early commitments including a $30 million stadium near Los Angeles. These infrastructure projects saw increased momentum ahead of the 2024 ICC T20 World Cup. The temporary Nassau County International Cricket Stadium in New York alone showcased rapid development, being built for the tournament within approximately 100 days. MLC’s inaugural 2023 season demonstrated strong market potential, generating $8 million in revenue across 19 matches played in Texas and North Carolina. Matches at Grand Prairie’s 7,200-seat stadium saw an average attendance exceeding 80 percent capacity, indicating robust fan engagement. MLC is on track to significantly increase the total US cricket infrastructure valuation, potentially exceeding $500 million with ongoing and planned developments.",
          "exalt_take": "India’s Champions Trophy win was not just a sporting achievement, it was a cultural flashpoint for Indian Americans across the US, many of whom held watch parties, flooded social media, and amplified a hybrid Indian-American identity. For a diaspora historically underrepresented in US popular sports culture, cricket offers both nostalgia and opportunity for rekindling emotional ties to India while reshaping the American sports landscape culturally and economically. With cricket set to debut at the 2028 Los Angeles Olympics and Major League Cricket attracting hundreds of millions in diaspora-backed investment, the sport’s growth now intersects with questions of representation, economic potential, and infrastructure policy. Indian American voters are not just fans, they are now stakeholders in a new era of sports development, particularly in states like Texas, California, New Jersey, and North Carolina. Local governments are already being lobbied to support venue expansion, youth leagues, and public-private partnerships. The political upside is clear: engaging Indian American communities through cricket is more than symbolic, it’s strategic. From stadium grants and visa reforms for athletes to funding for youth training and cultural festivals, both parties have a unique window to treat cricket not just as a game, but as a gateway to a growing and increasingly active electorate. For Democrats, support community-centered cricket development. Rally behind allocation of federal or state-level grants for multicultural sports infrastructure especially in Indian American-dense regions like Edison (NJ), Bay Area (CA), and Dallas (TX). Recognize cricket leagues as tools for community building in public schools and recreation departments. For Republicans, highlight MLC’s growth as a model of enterprise and entrepreneurship backed by Indian American investors, many of whom align with pro-business policy. Advocate for local tax incentives for stadium development, especially in red or swing states (e.g., Texas, North Carolina), support tax breaks or zoning incentives for cricket venue expansion.",
          "questions_from_community": [
            "Do you recognize the sentimental value of cricket beyond a sport for the Indian community?",
            "Do you support increased investment in developing cricketing infrastructure in the US?",
            "Do you believe that cricket in the US would be a major cultural victory for the Indian diaspora? Do you agree that it will deepen people-to-people ties between the twotow countries?"
          ],
          "tag": "Culture, Sports, Economy",
          "section": "INDIAN ISSUES",
          "posts": {
            "twitter_democratic": "“India’s Champions Trophy win is more than cricket—it’s a cultural flashpoint for Indian Americans. Democrats should back community-centered cricket development, from youth leagues to school sports infrastructure in NJ, CA & TX.”",
            "twitter_republican": "“Cricket’s rise in the US reflects enterprise & diaspora-backed investment. Republicans should highlight MLC growth as pro-business success, support tax incentives for stadiums & showcase Indian Americans as stakeholders in US sports.”",
            "instagram_facebook_democratic": "India’s Champions Trophy win has energized Indian American communities across the US—from Bay Area watch parties to Edison, NJ youth leagues. Cricket is not just nostalgia—it’s a path toward inclusive representation in American sports. #USIndia #ChampionsTrophy #CommunitySports #SouthAsianVoices #InclusiveInnovation #CricketInUSA #SportsDiplomacy",
            "instagram_facebook_republican": "India’s Champions Trophy victory isn’t just about cricket—it’s about enterprise, investment & opportunity. Cricket is now a strategic bridge between diaspora pride & American economic growth. #MLC #USIndia #CricketUSA #SportsEconomy #ProBusinessPolicy #SouthAsianVoices #IndoPacificCommunity"
          },
          "further_reading": [],
          "image": "https://www.tribuneindia.com/sortd-service/imaginary/v22-01/jpg/large/high?url=dGhldHJpYnVuZS1zb3J0ZC1wcm8tcHJvZC1zb3J0ZC9tZWRpYTMyYjYyMzgwLWZkMTYtMTFlZi1hOTk3LWUzYWEyZTRhMzM5Ni5qcGc=",
          "tweet_id": []
        }
      ]
    },
    "april": {
      "exalt_summary": "This brief covers major developments that impacted the Indian diaspora and US-India relations in April 2025. In this edition, we begin by looking at issues affecting the Indian diaspora in the United States. Following mounting legal pressure, ICE announced it would reinstate F-1 visa status for thousands of international students, a decision that followed widespread backlash from legal groups and Indian-American lawmakers. We also cover the assault on a South Asian family in a hate crime in Fremont, California, which highlights the insecurity faced by Indian-American communities. Next, we analyze the impact of the tragic killings of at least 26 Hindu tourists in Indian Kashmir, an attack that sparked global outcry and spurred Indian-American communities to organize vigils and protests across the United States. We then shift our focus to diplomatic and economic developments within India. We cover the high-profile visit of US Vice President JD Vance to India, accompanied by his Indian-origin wife, Usha Vance, which solidified US-India ties and focused on defense and energy trade. In a related development, India's imports of US crude oil made the US its fourth-largest supplier in April 2025. The brief concludes with a look at India's decision to sign a $7.5 billion contract to purchase 26 Rafale fighter jets from France, a move that signals India's continued diversification of its defense procurement away from Russia.",
      "details": [
        {
          "_id": "47",
          "title": "ICE announces reinstatement of F‑1 visa status after SEVIS termination sparks outrage",
          "context": "In response to mounting legal and political pressure, US Immigration and Customs Enforcement (ICE) announced that it would begin reinstating SEVIS records for international students who were not at fault, reversing a controversial policy that had abruptly stripped thousands of students of their F‑1 visa status. Earlier, ICE and the State Department had deactivated SEVIS records for at least 4,700 students, many of them Indian, citing past visa denials, minor infractions, or flawed data from law enforcement databases. The terminations led to an immediate loss of legal status, cutting off access to employment, housing, and university enrollment. Impact of SEVIS terminations, backlash: The visa cancellations triggered over 70 lawsuits and more than 40 temporary injunctions across 21 states with at least 45 temporary restraining orders (TROs), which forced ICE to reverse course. However, many students remain in legal limbo, particularly those whose F‑1 visas were formally revoked by the State Department and who are still barred from reentering the United States. The map above shows hotspots where the maximum number of students were impacted by the visa revocations. The Presidents' Alliance for Higher Education and Immigration, a coalition of over 570 campus leaders, filed a lawsuit in a Massachusetts district court challenging the Department of Homeland Security's mass termination of SEVIS records. The complaint named students from member institutions, including Boston University and MIT, as plaintiffs, arguing that the terminations lacked a legal basis and violated due process. Apart from legal action several Indian-American lawmakers including Reps. Ro Khanna and Pramila Jayapal spoke against the ICE ruling to galvanize support in Congress. Congresswoman Jayapal specifically led a letter with 142 members of Congress demanding accountability from the administration and an immediate reversal of the policy, calling the actions a politically motivated assault on due process. Indian Students in the US: India has overtaken China as the top sender of international students to the United States. One in every three international students in the US comes from India. In the 2023-24 academic year, 331,602 Indians were enrolled in US institutions, marking a 23 percent year-on-year increase and making up 29 percent of all international students. In terms of economic contributions, Indian students are the foundation of the US higher education economy, contributing an estimated $11.8 billion in tuition and living expenses in 2023, with maximum presence in states like California, New York, and Texas.",
          "exalt_take": "The reinstatement of SEVIS records is a welcome correction and a relief for thousands of immigrants, a majority of whom are Indian-origin. While ICE’s reversal came after legal pressure and public outrage, it’s unclear how many of the 4,700 plus affected students will fully recover their legal footing, especially those still stranded abroad due to visa revocations. With Indian students now representing nearly a third of all international students in the US and contributing over $11 billion to the education economy, abrupt enforcement actions like this one risk long-term damage to US higher education, labor markets, and global credibility. They also risk alienating Indian Americans for who view such instances as not just policy decisions but scathing attacks on legitimate pathways to immigration, the very channels they utilized to realize their American dream. This also explains why Indian-American lawmakers, legal groups, and diaspora advocates played a central role in pushing back against this overreach. It is important for public office holders to recognize the fears, anxiety, and chaos running through the community and support them accordingly. For Democrats, express solidarity with Indian-origin and other international students and push for legislative guardrails that prevent mass SEVIS terminations without individual review or notice. Champion accountability and oversight of immigration data-sharing between law enforcement and ICE. For Republicans, acknowledge the concerns of the community and reinforce America’s leadership in STEM education and innovation by protecting legal student pathways like F‑1 and OPT. Support targeted reforms to SEVIS and NCIC data systems to prevent wrongful enforcement without weakening border control. Frame student stability as an economic and diplomatic imperative, particularly with key partners like India.",
          "questions_from_community": [
            "Are international students disposable in today’s political climate?",
            "Will Indian students who arrive in the US seeking opportunity be treated fairly or left fighting for basic rights?",
            "Is due process still meaningful when immigration agencies act first and justify later?",
            "What will you do to ensure accountability when government institutions violate the rights of students and immigrants?",
            "How do you plan to protect vulnerable student populations when enforcement overreach threatens their futures?"
          ],
          "tag": "Immigration, Student Visas, F1, SEVIS",
          "section": "WHAT’S HAPPENING IN THE US",
          "further_reading": [],
          "image": "https://example.com/sevis_visa_status.jpg",
          "tweet_id": []
        },
        {
          "_id": "48",
          "title": "South Asian family assaulted in Fremont McDonald’s, man arrested with hate crime charges",
          "context": "A man has been arrested in Fremont, California, and charged with a hate crime and misdemeanor battery after slapping an Indian-American mother and throwing a sauce packet at her 9-year-old daughter while shouting, “You Indians need to go back to your country.” Surveillance footage and police investigation led to the arrest of 22‑year‑old Marcus Harper, who now faces prosecution. Political Response: The San Francisco Bay Area office of the Council on American-Islamic Relations, CAIR-SFBA released a statement welcoming the hate crime charges commended the District Attorney's office for taking the attack seriously Alameda County District Attorney Pamela Price said, \"This act of hate based upon the perceived national origin of these victims is completely unacceptable,\" assuring that such behavior would be prosecuted to the fullest extent. In Fremont, the current city leadership and Mayor Raj Salwan have a history of calling for stronger protections and community dialogues, citing the need for both vigilance and unity in the community. Indian Americans in the US: Indian Americans number over 5.2 million in the US, making up roughly 1.6 percent of the national population. They are the second-largest Asian group in the US and one of the fastest-growing and highest-income ethnic groups. California hosts the largest Indian-American population of over 960,000, with several cities including Fremont, Cupertino, and San Jose, ranked among the highest concentrations in the nation. In particular, Fremont is a key Indian-American hub in the Bay Area, and the New York Times reported in 2024, that the San Francisco-San Jose-Oakland Combined Statistical Area (CSA) has an Asian Indian population of 513,349. The map above shows the highest number of Indians are concentrated in California, with Alameda County (which Fremont is a part of), being one of the largest Indian populations in a county across the country. Hate Crimes stats in Georgia: Georgia recorded 142 hate crime incidents in 2023, down from 197 in 2022 and 248 in 2021. Still, among these, 81 cases (57 percent) were driven by race, ethnicity, or ancestry bias. Crimes against persons accounted for 77.3 percent of bias-driven incidents underscoring that racial hostility often translates into direct violence. Events motivated by religion bias increased by 3 percent, while anti-Hindu bias events rose from 7 in 2023 to 10 in 2024.",
          "exalt_take": "The assault incident in a city with one of the largest Indian-origin populations like Fremont is an alarming incident. What adds to the gravity is that it is not an isolated incident but a part of a growing pattern of racially motivated attacks that increasingly target South Asian communities, even in diverse, immigrant-rich regions like the Bay Area. That it occurred in broad daylight at a family restaurant underscores the urgency of improving local law enforcement responsiveness. With California housing nearly a million Indian Americans and Fremont being a central hub this incident resonates far beyond one city, highlighting the insecurity felt by a community that is among the most visible and economically successful immigrant groups in the country. Public officeholders must issue a statement recognizing the incident as a hate crime, express solidarity with the victims and reassure Indian and other immigrant groups in the US of their safety by calling for prosecution to the fullest extent. For Democrats, bolster local and federal funding for hate crime tracking, disaggregated data collection (including by national origin), and support services for immigrant victims of violence. Push for passage of legislation to improve local hate crime reporting and victim support, especially for South Asian, Muslim, Sikh, and Hindu Americans who remain underrepresented in federal hate crime data. Encourage community-based interventions, including school-level anti-bias programming and cultural sensitivity training for law enforcement officers in high-diversity districts. For Republicans, acknowledge the attack as an assault on American values of safety, decency, and individual freedom regardless of background, and support stronger enforcement of existing hate crime laws. Promote bipartisan backing for resources that protect all residents including immigrant families from targeted violence, ensuring swift prosecutions and fair trials for such offenses. Reinforce the need for community safety partnerships that involve faith leaders, community associations, and local businesses in hate crime prevention efforts. This is a moment for leaders across the aisle to reaffirm that immigrant communities are not only integral to the American fabric but also entitled to equal protection under law.",
          "questions_from_community": [
            "What will you do to ensure the safety of Indian Americans and other immigrant communities in the US, especially in light of rising hate crimes?",
            "Do you believe current hate crime laws are adequate? If not, will you support stricter penalties and stronger enforcement mechanisms?",
            "How will you support local law enforcement and community organizations working to protect vulnerable groups from racially motivated violence?",
            "What steps will you take to improve hate crime reporting and ensure these incidents are not ignored or undercounted?"
          ],
          "tag": "Hate Crimes, Racial Discrimination, Community Safety",
          "section": "WHAT’S HAPPENING IN THE US",
          "further_reading": [],
          "image": "https://example.com/fremont_hate_crime.jpg",
          "tweet_id": []
        },
        {
          "_id": "49",
          "title": "Indian-Origin tech student Akash Banerjee shot dead in Georgia",
          "context": "Akash Banerjee, a 22-year-old Indian-origin graduate student studying near Georgia Tech in Atlanta, was found fatally shot in an apartment building on May 18, 2025. Local law enforcement said that the incident was a targeted attack and released surveillance footage of the suspect. Tip: Indian Americans are the largest Asian American group in Georgia and a significant voting bloc in a key battleground state. On May 26, Nigel Belser, a 21-year-old, surrendered to authorities and was charged with murder, aggravated assault, and possession of a firearm during a felony. Indians in Georgia and the US: Georgia’s demographic fabric has been notably reshaped over the last decade by its rapidly growing Indian-American community. According to the US Census Bureau and migration policy data, Indians accounted for approximately 8.6 percent of all immigrants in Georgia as of 2020, making them a prominent group in the state’s diverse foreign-born population. More recent estimates from the 2023 American Community Survey place Georgia’s Asian population at 27.1 percent, which includes a significant segment of Indian Americans. Indian Americans are the largest Asian subgroup in Georgia. Across the US, the Indian-American population has climbed to nearly 4.9 million individuals as of 2023, according to the Pew Research Center’s analysis of American Community Survey data, making them the second-largest Asian-origin group nationally, and nearly 21% of all Asian Americans. The map above shows the number of immigrants from India in Georgia, between 2019 and 2023. Georgia has a significant Indian American population when compared to the national distribution. Hate Crimes stats in Georgia: Georgia recorded 142 hate crime incidents in 2023, down from 197 in 2022 and 248 in 2021. Still, among these, 81 cases (57 percent) were driven by race, ethnicity, or ancestry bias. Crimes against persons accounted for 77.3 percent of bias-driven incidents underscoring that racial hostility often translates into direct violence. Nationally, the FBI recorded 11,679 hate crime incidents in 2024, the second-highest total on record. Over half of these were motivated by racial or ethnic bias, underscoring the persistence of such violence. Anti-Asian hate crimes remained alarmingly high in 2024, and at least three times the pre-pandemic average, marking one of the worst periods for Asian-targeted attacks on record. Indian Americans on Gun Laws: Indian-American voters increasingly view gun control as a defining electoral issue. A recent 2024 Asian American Voter Survey found that 82 percent of Indian-American voters support stricter gun laws in the US, with 60 percent expressing very strong agreement. Moreover, about 73 percent said they would not vote for a candidate with opposing views on gun policy highlighting how central this issue is to voting decisions in Indian-American communities.",
          "exalt_take": "The tragic killing of Akash Banerjee underscores the longstanding concerns regarding gun violence, safety for international students, and rising hate crimes in the US. Georgia’s growing Indian-American population, including over 150,000 residents and thousands of international students, is an influential demographic group whose safety concerns must be prioritized. This incident is not isolated. Indian-Americans consistently report concerns about racial profiling, lax gun laws, and a political climate that oscillates between rhetorical embrace and bureaucratic hostility. With Georgia a closely contested swing state, political leaders have a responsibility to address this moment not only with condolences but with action. Public office holders must issue strong statements condemning Banerjee’s death and express solidarity with the community, reassuring them of prosecution to the fullest extent of the law. For Democrats, introduce or support targeted legislation for enhanced campus safety, gun control reform, and hate crime tracking, particularly for areas with large international student populations. Engage Georgia’s Indian-American communities through listening sessions on racialized violence and immigrant vulnerability. For Republicans, condemn violence without qualification and reinforce a commitment to protecting all legal residents, including international students. Promote “community policing” or local safety initiatives that prioritize student safety while aligning with conservative governance frameworks.",
          "questions_from_community": [
            "Will Banerjee’s family get justice?",
            "Do you think stricter gun laws would have prevented this pointless death?",
            "Do you think there is enough being done to protect the safety interests of immigrants?",
            "How will you work to address rising gun violence in communities with large immigrant populations?",
            "Do you believe background checks should be expanded to all gun sales, including private and online transactions?",
            "What steps will you take to ensure that hate crimes against immigrant communities are investigated thoroughly and prosecuted?",
            "Do you support funding community-based safety programs specifically tailored to immigrant and minority neighborhoods?",
            "How will you ensure law enforcement agencies are trained to identify and respond to hate crimes against South Asian Americans?",
            "Do you support federal requirements for states to submit timely hate crime data disaggregated by ethnicity and national origin?"
          ],
          "tag": "Gun Violence, Hate Crimes, Student Safety",
          "section": "WHAT’S HAPPENING IN THE US",
          "further_reading": [],
          "image": "https://example.com/akash_banerjee_student.jpg",
          "tweet_id": []
        },
        {
          "_id": "50",
          "title": "US suspends scheduling of new student visas amid social media vetting",
          "context": "The Trump administration via the US State Department directed embassies and consulates to halt scheduling new F-1 and J-1 student visa appointments as it implements an expanded social-media vetting process for student and exchange-visitor applicants. The mandate requires consular officers to review applicants’ public (and in some cases private) social accounts and historical identifiers before new interview slots are opened. Universities and student groups have protested, warning the move will slow admissions and chill academic exchange. Tip: A report on pilot programs for social media screening noted that information from social media accounts \"did not yield clear, articulable links to national security concerns.\" The government has failed to demonstrate that social media screening is an effective national national security tool. Advocacy groups argue that the policy can have a detrimental effect on free speech, causing applicants to self-censor their online activity for fear of visa denial. Reactions from campuses and officials over rights concerns: Harvard and other campuses publicly protested the expanded vetting, calling it as an attack on academic exchange and an affront to institutional autonomy. The State Department began a pilot focused on high-profile schools such as Harvard before wider implementation of the directive, prompting sharp pushback from university leaders and civil-liberties groups, who argue the practice lacks clear standards and redress. Administration officials justify the change on national-security grounds, but critics say the policy risks invasive, opaque screening that could be applied unevenly across nationalities and disciplines and is directly at odds with the First Amendment which protects freedom of speech and expression. Existing visa backlogs: The scale of disruption is large because the US hosts a record number of international students with 1,126,690 international students in 2023-24 alone, a 7 percent year-on-year rise. The chart below shows the number of student visas issued at Indian consulates over the years. In fiscal year 2024, the US issued 61,819 F-1 visas to Indian students, a 34 percent drop from the previous year, meanwhile, Indian enrollments to US colleges kept increasing. India remains the largest single source of those students. This existing slowdown, combined with the suspension, which occurred during the peak visa processing season, has created a significant backlog. India had over 330,000 enrolled in 2023-24, making up nearly one-third of the total. The suspension, even if short, risks delaying tens of thousands of incoming students, as evidenced by a report suggesting over 100,000 Indian students were waiting to book visa slots ahead of the Fall 2025 intake. This situation is further compounded by new social media vetting policies that add to processing times and create uncertainty. Dissent, deportations and social media: The decision to halt visa appointments comes amid an already fraught context where online speech has intersected with immigration enforcement. Several high-profile cases in 2025 saw visa revocations or self-deportations linked to alleged online support for designated organizations, for example, Columbia doctoral student Ranjani Srinivasan self-deported from the US after immigration action tied to online activity. Civil-liberties groups warn that formalizing social-media vetting increases the risk lawful academic speech or protest could be treated as grounds for denial or removal absent transparent standards. Indian American voter attitudes on Immigration: Based on the 2024 Asian American Voter Survey, most Indian American voters view immigration as a critical issue shaping their electoral choices. 73 percent say it is extremely or very important in how they plan to vote, and 71 percent support policies that make it easier for immigrants to sponsor family members for visas. Reflecting the depth of feeling, just over half (51 percent) said they would not support a candidate who holds opposing views on immigration.",
          "exalt_take": "The suspension of new student visa appointment scheduling amid expanded social-media vetting underscores persistent challenges in balancing national security concerns with America’s role as a global education leader. The impact falls disproportionately on Indian students, the largest cohort of international students in the US jeopardizing academic plans, research projects, and vital STEM talent pipelines. Public office holders must recognize that unpredictability in visa policies fuels community anxiety and threatens long-term strategic interests in education, innovation, and diplomatic goodwill. Visa backlogs are a huge issue for the Indian community and recognizing their concerns while reassuring them of quick action would go a long way in strengthening connections with the group. For Democrats, advocate for transparency on the vetting process, including clear timelines and publicly available data on visa backlogs by nationality and visa type. Push for strong privacy protections and appeal rights in social-media screening to safeguard due process and prevent discrimination. Highlight the economic and innovation benefits of international students in STEM fields to counter restrictive immigration narratives. For Republicans, emphasize the importance of securing borders and vetting applicants in the digital age, but balance this with measures that minimize harm to legitimate students and academic institutions. Engage with diaspora communities to address concerns transparently and build trust in immigration policies.",
          "questions_from_community": [
            "How do you plan to address the current backlog of student visa appointments, especially for first-time applicants from India?",
            "Do you acknowledge and share concerns about privacy and potential violations of free speech tied to the expanded social media vetting process?",
            "What safeguards will you implement to ensure visa applicants have transparent appeal rights if flagged during social media screening?"
          ],
          "tag": "Immigration, Student Visas, Social Media Vetting",
          "section": "WHAT’S HAPPENING IN THE US",
          "further_reading": [],
          "image": "https://example.com/social_media_vetting.jpg",
          "tweet_id": []
        },
        {
          "_id": "51",
          "title": "USCIS Director Nominee Joseph Edlow calls for end to employment authorizations beyond academic programs",
          "context": "During his Senate confirmation hearing for Director of the US Citizenship and Immigration Services (USCIS), Joseph Edlow, President Trump’s nominee, voiced his desire to end the Optional Practical Training (OPT) and STEM OPT programs, employment authorization policies that allow international students, including many from India, to remain in the US for up to three years post-graduation to gain practical work experience. Tip: According to the Student and Exchange Visitor Information System (SEVIS), Tech giants Amazon, Google, and Microsoft are top recruiters of international students through the Optional Practical Training (OPT) program, particularly in science, technology, engineering, and mathematics (STEM) fields. Amazon led with 6,679 new hires in 2024. Google followed with 1,778, Microsoft with 1,496, and Meta with 1,302. Edlow argued that any employment authorizations extending beyond academic study overstep regulatory authority, a stance that is in stark contrast to that of Trump who said that international students should get green cards upon graduation. GOP’s shifting stance on OPT: The OPT program was started in 1992. Historically, Democrats have generally supported expansions to OPT and international student pathways. When STEM‑OPT extensions were introduced in 2008, spurred by testimony from tech leaders like Bill Gates, Democratic‑backed STEM advocacy helped push the policy forward. Meanwhile, the Republican party’s stance has oscillated between economic pragmatism and regulatory restraint. In June 2020, amid pandemic-induced unemployment, a group of Republican House members sent a letter to the Trump administration defending OPT. They argued the program was essential for US competitiveness and international students seeking post-completion training experience, signalling their willingness to prioritize economic stability over broader immigration crackdown. In 2021, Representative Paul Gosar (R‑AZ) introduced the Americans First OPT Reform Act aiming to eliminate OPT. He criticized the program for being unauthorized, disadvantaging American workers, and allowing employers to bypass visa caps. Recently, a coalition of Republican senators, including Ted Cruz and Mike Lee, pushed to prompt Supreme Court review of OPT, over labor market concerns. Impact of OPT program: OPT (Optional Practical Training) and STEM OPT extensions are crucial pathways to employment for those in the US higher education ecosystem, especially for Indian students. In 2023-24, 97,556 Indian students used the OPT pathway, marking a 41 percent increase year-over-year for Indian OPT participation, while 331,602 Indian students held overall enrollment in the US, a 23 percent rise from the previous year. Indian students now account for the largest share of international students) and in 2024, India led all countries with 422,335 active SEVIS records, crossing China's 329,541. OPT participation grew nationwide to a record 242,782 students in 2023-24, up 22 percent from the prior year. Indian nationals accounted for 48 percent of STEM OPT authorizations, way more than any other country. In total, 194,554 international students worked under OPT in 2024, a 21.1 increase year-over-year. These trends highlight how OPT has become a critical bridge between international students and the US workforce particularly in tech and STEM fields.",
          "exalt_take": "The Trump administration’s revived push to end Optional Practical Training (OPT) and STEM OPT is a scathing attack on the limited legitimate pathways to employment for international students, especially from India. Indians represent the largest cohort using OPT and face uncertainty about their futures, even as they invest heavily in US education. The programs in question are not loopholes, they are structured, regulated bridges between higher education and the workforce, central to the US appeal for top global talent. Ending them would not only sever these bridges but also damage US universities, tech industries, and the broader economy, all of which benefit from the skills and spending of foreign graduates. This move risks accelerating the global talent shift away from the US toward countries with more stable post-study work opportunities. For Democrats, lean into your longstanding support for international education and skilled immigration. Reintroduce or strengthen legislative protections for OPT and STEM OPT, and hold the line against executive overreach. Frame the issue as one of economic competitiveness, workforce development, and educational excellence especially in STEM sectors. Highlight the disproportionate impact on Indian students and Indian American communities, many of whom see these programs as pathways to the American dream. Explicitly call out Edlow’s OPT stance and express solidarity with international students and Indians who pursue the American dream. For Republicans, exercise restraint in politicizing academic-to-employment pipelines. While border security and immigration enforcement remain core to your platform, aggressive targeting of international student work programs may undercut US economic and technological leadership and also alienate a key voting bloc, that is, Indian Americans. If weighing reforms, focus on compliance and oversight not blanket elimination. Minimal commentary on Edlow’s OPT stance may be politically wiser than full-throated endorsement, particularly in battleground states with strong higher education and tech sectors.",
          "questions_from_community": [
            "Do you agree with Joseph Edlow’s stance on ending the OPT and STEM OPT programs?",
            "Considering that a huge majority of OPT beneficiaries are Indian students, do you believe international students are no longer welcome in the United States?",
            "Despite their significant economic contributions, why are international students being treated as disposable?",
            "How will you support and advocate for the interests of international students?",
            "Do you think OPT programs threaten American jobs?"
          ],
          "tag": "Immigration, OPT, STEM, Tech Workers",
          "section": "WHAT’S HAPPENING IN THE US",
          "further_reading": [],
          "image": "https://example.com/joseph_edlow_uscis.jpg",
          "tweet_id": []
        }
      ]
    }
,
  "June": {
    "summary": "This brief covers major developments that impacted the Indian diaspora in the United States and within India between June 16th to July 1st 2025. In this edition, Exalt delves into key political shifts, highlighted by Indian-origin Zohran Mamdani's historic victory in the New York City Democratic mayoral primary, analyzing its implications for Indian American political influence and the community's growing financial clout. The report also addresses pressing social issues, including the multiple shootings at the Utah ISKCON temple, amid a spate of recent, religiously motivated hate crimes. Furthermore, the brief dissects India's rising global stature through space achievements like astronaut Shubhanshu Shukla's mission to the International Space Station, a nod to the deepening India-US space ties, as well as the geopolitical ramifications of India-US' critical mineral collaborations. The brief also examines the evolving India-US private partnerships in key sectors like pharmaceuticals and tech, with Eli Lilly's Mounjaro launch in India, and Cognizant's $183 million investment decision in India. Finally, Exalt breaks down the complexities surrounding India's Russian oil imports and the key developments from India's attendance at the Shanghai Cooperation Organization (SCO) defense ministers' meeting in China. We have compiled a list of festivals and events that focus on the Indian diaspora in the area you aim to reach out to. The analysis, trends, and inputs of this personalized report were created taking into consideration the demographics of (name of the region).",
    "details": [
      {
        "_id": "60",
        "section": "Indian Diaspora Issues in the United States",
        "title": "Indian-origin Zohran Mamdani wins New York City Democratic mayoral primary",
        "tag": "Politics, Diaspora",
        "context": "Zohran Mamdani, a 33-year-old Indian-origin Muslim and progressive New York State Assemblyman, made headlines for his historic win in the New York City Democratic mayoral primary, defeating former Governor Andrew Cuomo with 56 percent of the vote compared to Cuomo's 44 percent. [9] Winning with the highest number of votes for a Democratic primary in NYC since 1989, Mamdani's candidacy and victory suggest a shift in urban politics with wider implications for Indian-American political influence. [9, 36, 37, 40, 41] Indian Americans make up the second-largest immigrant group in the United States, with a population exceeding 5.2 million, with approximately 2.1 million eligible voters. In the 2020 elections, Indian Americans recorded the highest voter turnout among Asian American groups, with 71% casting their ballots. Mamdani's momentous win in the mayoral primary with a margin of 124,974 votes, underscores the role of the engaged Indian American electorate in closely contested races. The Indian American demographic growth is also accompanied by increased political representation. While Indian Americans constitute 0.6 percent of the adult citizen population in the US, they hold over 4.4 percent of senior government positions. Mamdani's mayoral primary campaign was notably \"fueled by small-dollar donors\" and drew support from a diverse base, including \"working-class neighborhoods, Muslim communities, and young progressives.\" His campaign garnered support nationally, leading with 4,494 out-of-state donations, significantly more than his opponent, suggesting a widespread resonance with his message. Interestingly, a majority of Mamdani's high number of out-of-state donations came from California (784), Texas (187), New Jersey (436), and Illinois (210) - states with the maximum number of Indian Americans across the US. This fundraising success aligns with the significant and growing financial power of the Indian American diaspora. Indian Americans consistently rank as the highest-earning ethnic group in the United States. In 2023, Indian American households had a median annual income of approximately $151,200, which is about 40% higher than that of Chinese and Japanese households and significantly greater than the overall U.S. median household income.",
        "exalt_take": "Zohran Mamdani's victory is a successful case study in the use of meaningful culturally targeted outreach and mobilizing diaspora groups by talking about issues communities care about. Publicly recognize and celebrate the cultural and economic contributions of the Indian American community to the nation. For Democrats, this win underscores the importance of recognizing the evolving priorities of second-generation Indian Americans, many of whom are diverging from their parents' moderate politics in favor of more progressive platforms focused on housing justice, climate policy, labor protections, and racial equity. Mamdani's resonance with South Asian and Muslim voters also highlights the growing relevance of intersectional identities in political outreach. Avoid assuming political homogeneity within South Asian communities given that issues like caste, immigration, and police accountability are increasingly relevant. For Republicans, support policies that promote small business growth, reduce regulatory burdens, and foster a strong economy, as these traditionally appeal to entrepreneurial segments within the Indian American community. Engage on immigration reform to address the concerns of families and skilled workers, acknowledging the importance of immigration to the Indian American community. Dismissing Mamdani's win as a New York outlier would be a missed opportunity for those hoping to build lasting coalitions with one of America's most influential immigrant groups.",
        "questions_from_community": [
          "Do you recognize the growing need for targeted language and cultural outreach efforts to effectively engage with diverse segments of the Indian American community, as exemplified by successful campaigns like Mamdani's?",
          "Given the success of campaigns fueled by grassroots efforts and small-dollar donors, do you agree that prioritizing small donations is vital for building a robust and community-supported political campaign?",
          "Do you agree that Zohran Mamdani's mayoral primary win highlights a significant shift in the Indian American community's political influence?",
          "How will your office facilitate direct engagement with the diverse segments of the Indian American community beyond traditional political events, particularly those who may feel underrepresented?"
        ]
      },
      {
        "_id": "61",
        "section": "Indian Diaspora Issues in the United States",
        "title": "Utah ISKCON temple in Spanish Fork suffers multiple shootings",
        "tag": "Social Issues, Hate Crime",
        "context": "The ISKCON Sri Sri Radha Krishna Temple in Spanish Fork, Utah, endured a series of disturbing attacks, with over two dozen (20-30) bullets fired at its premises over several nights in June. [6, 33, 34] These incidents, suspected to be hate crimes, caused significant structural damage while endangering those present inside the premises during shootings, intensifying concerns within the community. [6, 33, 34] Temple officials have strongly condemned the attacks. Vai Warden, the temple president, described the incidents as a \"serious attack that was planned\" and \"motivated by hate.\" [34] The temple has confirmed that between 20 to 30 bullets struck the building and surrounding property, causing damage to its architecture. [6, 33, 34] In response to these repeated acts of violence, the temple is enhancing its safety measures, seeking information leading to arrests, and has offered a reward. The Consulate General of India in San Francisco also issued a statement condemning the firing incident and extending full support to the community while urging prompt action from local authorities. [33] The ISKCON Spanish Fork shooting is not a one-off incident but a part of a concerning trend of attacks against religious institutions and minority communities in the US. According to the FBI's 2023 Hate Crimes Statistics report, there were 2,699 reported incidents based on religion, accounting for 22.5 percent of all hate crime incidents. The Coalition of Hindus of North America (CoHNA) has specifically documented a \"rising spate of hate and violence\" against Hindu temples in the US, citing numerous incidents of vandalism, desecration, and even gunfire. The Spanish Fork shooting is explicitly listed by CoHNA as a hate crime. Attacks on places of worship have shown concerning trends. A report by the A-Mark Foundation on violent attacks targeting houses of worship between 2012 and 2022 found that shootings accounted for 40% of attacks, causing 94% of deaths and 61% of non-fatal injuries. The most frequent motive for these attacks was racial, ethnic, or religious hatred, accounting for at least 49% of perpetrators' motives. The rise in such incidents underscores a pervasive fear within minority religious communities, highlighting the urgent need for enhanced security measures and robust investigations into these bias-motivated crimes. The recent shootings at the ISKCON temple in Spanish Fork, bring the issue of gun violence and gun control sharply into focus for the Indian diaspora in the United States. Data from a 2022 Asian American Voter Survey by AAPI Data indicates a strong sentiment for stricter gun laws within the community, with 83% of Indian Americans believing the U.S. needs more stringent regulations. The Hindu American Foundation (HAF) has also publicly advocated for \"common sense gun legislation\", emphasizing measures such as universal background checks, mandatory waiting periods, and a ban on assault weapons and high-capacity magazines. The contrast with India's stricter gun control laws, where private gun ownership is heavily regulated and rarely granted, also shapes the diaspora's views.",
        "exalt_take": "The ISKCON temple shootings in Spanish Fork are not isolated incidents of vandalism but a part of a growing, troubling pattern of hate violence against minority religious communities in the US. With over two dozen bullets fired across multiple nights, the attacks reveal not just the vulnerability of Hindu institutions, but demands more than performative condemnation. According to the FBI, over 22% of all reported hate crimes in 2023 were religiously motivated. The Spanish Fork incident must be treated as a hate crime and investigated as such. Public office holders must issue strong statements condemning the attacks and reassure the Hindu American community of their safety and right to practice their faith peacefully. For Democrats, leverage this moment to prioritize and advocate for comprehensive gun control legislation. Support stricter gun laws, including universal background checks, assault weapon bans, and red flag laws. This addresses the prevalent sentiment within the Indian American community and can help solidify support. Frame stricter gun laws as essential for protecting communities and places of worship from violence, a message that resonates deeply after incidents like the Spanish Fork shooting. Work closely with leaders and organizations from the Hindu, Sikh, and other minority religious communities to meaningfully engage with the affected communities and understand their specific safety concerns. For Republicans, while upholding Second Amendment principles, acknowledge the legitimate fears and safety concerns of the Indian American community, particularly after the Utah incident, regarding hate crimes and mass violence. Be unequivocal in condemning hate crimes against religious institutions and minority communities, reinforcing a commitment to protecting all citizens.",
        "questions_from_community": [
          "Will the perpetrators of the attacks on the ISKCON temple in Spanish Fork be punished? Will Hindu Americans get justice?",
          "Do you believe the Utah shooting incident to be a hate crime?",
          "Do you believe that stricter gun regulations would have prevented the Utah shooting incident?",
          "What concrete steps will you take to prevent future hate-motivated attacks on religious institutions like the ISKCON temple in Spanish Fork?"
        ]
      },
      {
        "_id": "62",
        "section": "What's happening in India?",
        "title": "Astronaut Shubhanshu Shukla becomes first Indian at International Space Station in 41 years",
        "tag": "Space, Science & Tech",
        "context": "Group Captain Shubhanshu Shukla became the first Indian astronaut at the International Space Station (ISS) in over four decades, highlighting India's growing role in space exploration. [22, 23, 27, 30, 35] Axiom Mission 4 (Ax-4), a private spaceflight to the ISS, is a landmark collaboration between SpaceX, National Aeronautics and Space Administration (NASA), and Indian Space Research Organisation (ISRO). The crew of four consists of commander Peggy Whitson, an Axiom employee and former NASA astronaut; pilot Shubhanshu Shukla of the Indian Space Research Organisation; and mission specialists Sławosz Uznański-Wiśniewski, a European Space Agency project astronaut from Poland, and Tibor Kapu representing the Hungarian Space Office. Shukla's inclusion reflects not only India's return to spaceflight but also the strengthening of the India-US partnership in a strategic sector. [22, 27, 30, 35] India-US space collaboration has been increasing, especially with joint space missions, satellite launches, and advancements in technology, highlighting India's emergence as a global hub for cost-effective services in the geospatial sector. Partnership with the US is key for India to achieve a $44 billion space sector by 2033. ISRO and NASA have a longstanding multifaceted relationship including NASA-ISRO SAR (NISAR), a joint Earth-observing mission valued at $1.5 billion.",
        "exalt_take": "Breakthroughs in space exploration are a huge source of pride for the Indian diaspora. Recent achievements, including India's Chandrayaan-3's soft landing on the moon sparked global celebrations. The return of an Indian to space after 41 years is a historic moment for Indians around the world. Engage via social platforms to welcome the success of the Ax-4 mission, issue statements that mirror the diaspora sentiment and publicly back India-US space collaboration, extending support to expanded funding to the iCET (Initiative on Critical and Emerging Technologies). It is important to underscore the success of the India-US partnership and its potential across critical sectors like space. You could also leverage community spaces to sponsor watch parties or STEM outreach at diaspora hubs to boost emotional resonance.",
        "questions_from_community": [
          "Do you support deeper space collaboration between India and the United States?",
          "Should the US invest more in joint space missions and satellite programs with India?",
          "Do you think partnerships like Starlink entering India are a result of space collaboration?",
          "Do you think more such collaborations between private companies like Axiom be encouraged with Indian and US national space agencies?"
        ]
      },
      {
        "_id": "63",
        "section": "What's happening in India?",
        "title": "India ramps up global mineral diversification efforts to reduce dependence on China",
        "tag": "Economy, Geopolitics, Minerals",
        "context": "India is diversifying sources for rare earth materials to reduce its acute dependence on China to mitigate supply chain threats after China imposed export restrictions in response to US tariffs. [10, 16, 21, 25] Rare earth materials are crucial in manufacturing automobiles, electric vehicles (EVs), and renewable energy infrastructure. [10, 16, 21, 25] China controls approximately 70 percent of global rare-earth production as of 2023 and the US ranks second at about 12 percent, with countries like Australia, Myanmar, and India each providing less than 10 percent. This dominance extends beyond mining, China also processes nearly 90 percent of the world's rare-earth elements' output magnets used in EVs and defense manufacturing, with export restrictions threatening crucial supply chains. [16, 21] In April 2025, China imposed export curbs on seven rare earths and related magnets in response to US tariffs. [25] Since then, rare earth magnet exports from China fell roughly 75 percent, forcing some automaker production lines in Asia, Europe and the United States to shut down, exposing China's decisive control over vulnerable supply chains. In 2023, of the $1 billion in critical minerals exports by India 37 percent went to the US, European Union, and Japan combined, and over $595 million of that tied to battery-grade materials, of which the US and EU are the main consumers. For Sona Comstar, India's biggest importer of rare earth magnets, the US currently accounts for about 40 percent of Sona Comstar's revenue, ahead of India and Europe. Quad nations- India, US, Japan, and Australia have agreed to expand collaboration on rare earth material supply to ensure reliability of high-tech production supply chains in the future amid the looming Chinese threat. India is exploring acquisition opportunities for critical minerals in Africa, Australia and South America, and the government has announced an ambitious scheme of 5000 crore rupees (approx. USD 600 million) to incentivise domestic production. [10, 21, 25]",
        "exalt_take": "India's decision for rare earth elements and mineral diversification is a direct response to the vulnerability of high-tech supply chains given China's supply monopoly. China accounts for over 70% of global rare earth mining and nearly 90% of processing capacity, a chokehold that has already disrupted global EV and defense manufacturing when Beijing imposed export curbs this year. [21] Given this geopolitical reality and the fact that building alternatives to Chinese supply chains will take years, it is important to publicly underscore the importance of strategic mineral alliances, especially in the Indo-Pacific. There is an opportunity to publicly express support for India's efforts while helping shape a more stable and diversified global supply network. Supporting legislation that encourages US investment in India's critical mineral infrastructure from mining to processing, serves both economic and strategic interests. However, while backing India's strategy, it's advisable to avoid rhetoric that explicitly targets China. The Indian diaspora in the US remains closely attuned to regional dynamics, and highlighting the India-US partnership as a broader positive alliance rather than a stance against Beijing will resonate effectively.",
        "questions_from_community": [
          "How crucial do you believe the India-US relationship is when it comes to rare earth elements?",
          "Do you support US-led investments in building critical minerals and rare earth materials infrastructure in India?",
          "Will you support legislation that allocates funding or tax incentives for American companies to partner with India on mineral innovation and infrastructure?"
        ]
      },
      {
        "_id": "64",
        "section": "What's happening in India?",
        "title": "US-based Eli Lilly to launch its Mounjaro pen to fight type 2 diabetes in India after positive response to obesity drug",
        "tag": "Healthcare, Pharmaceuticals, Business",
        "context": "Journeying from Indiana to India, US-based Eli Lilly announced their decision to launch its Mounjaro pen to fight type 2 diabetes in India. [5, 8, 12, 13, 14] Eli Lilly dominates the insulin and diabetes space in the U.S., with approximately 64 percent of its 2024 revenues over $30 billion coming from American sales and the Indian market is a major growth opportunity for their most profitable US division. Their decision to launch Mounjaro in India also comes within broader India-US pharmaceutical cooperation. India is the world's largest supplier of generic drugs, and in the US, where nine out of ten prescriptions dispensed are for generics, India provides around 40 percent.",
        "exalt_take": "South Asians are up to four times more likely to develop Type 2 diabetes than white Americans, even at lower body weights. Thus, the launch of a diabetes drug in India is not just an economic development but also a personal win for the community which is far more vulnerable to the chronic disease. Leverage this moment to showcase your understanding of the community's needs and issue a statement of support welcoming Eli Lilly's decision and highlighting India as a key partner in fighting chronic diseases. As India grows in stature as a global pharma hub, the US must treat India-pharma ties as a public health issue, not just a trade issue. Biden administration's past moves to exempt Indian pharmaceuticals from tariffs during broader US-China decoupling efforts show there's precedent and necessity. For Democrats, who already frame healthcare as a human right, publicly push for more equitable global access by strengthening generic drug importation frameworks and expanding cross-border approval pipelines, especially for underserved racial and ethnic groups. For Republicans, who prioritize lower costs and American business interests, the India-pharma relationship is a solution to the runaway drug prices. Supporting deeper US-India R&D collaboration can secure affordable inputs while bolstering national supply chain resilience without expanding domestic regulation.",
        "questions_from_community": [
          "Would you support more public-private partnerships with Indian pharma firms to reduce healthcare costs here at home?",
          "What are you doing to make life-saving drugs like insulin and diabetes medication more affordable in the US?",
          "Given India's massive role in supplying generics, do you believe there is a need to protect US access to those medicines?",
          "Will tariff and trade deal discussions impact pharmaceutical sector developments between India and the US?"
        ]
      },
      {
        "_id": "65",
        "section": "What's happening in India?",
        "title": "India's Russian oil imports hit record high despite Western pressure",
        "tag": "Energy, Geopolitics, International Relations",
        "context": "India's crude oil imports from Russia hit a two-year high in June at nearly 2.08 million barrels per day (bpd), highlighting India's non-aligned energy strategy in face of Western sanctions against Moscow over the Ukraine conflict. [17, 26, 28, 32] Russia is the world's third-largest oil producer, behind the US and Saudi Arabia. In 2024, it accounted for roughly 10 percent of global crude production and over 12 percent of seaborne oil exports, most of it now redirected from Europe to Asia. Following US sanctions, European Union bans and G7 price caps in response to Russia's invasion of Ukraine, India and China now purchase over 90 percent of Russia's seaborne crude, effectively boosting Moscow's oil revenues despite curbs. [17] India is the world's third-largest crude oil importer, meeting over 85% of its domestic needs through imports. In the fiscal year 2024-25, India spent approximately $242.4 billion on crude oil imports. While India has called for a ceasefire, dialogue and diplomacy to end the Ukraine conflict, it has drawn criticism for its non-alignment, lack of direct criticism towards Moscow, and abstinence from United Nations votes. India has maintained that its pivot is purely a pragmatic decision based on cost analysis. Russian Urals crude has consistently traded at $10-15 cheaper per barrel than Brent, helping India keep inflation in check. According to the US Energy Information Administration, US exports of crude oil and petroleum products to India rose 15 percent year-on-year in 2024, totaling 218000 billion barrels per day. In comparison, Russian oil exports to India only rose by 7.3 percent, but totalled around 1.76 billion barrels per day accounting for roughly 36 percent of the total crude oil imports. [17, 26, 28, 38] India's Russian oil imports present a complex geopolitical situation. While India remains a pivotal US partner in Indo-Pacific security, climate cooperation, and key trade sectors such as pharmaceuticals, it is simultaneously enabling Russian revenues that the US seeks to halt.",
        "exalt_take": "India's record-high Russian oil imports highlight the country's non-alignment strategy and complicates its relationship with the US, where legislative responses like the proposed Russia Sanctions Act risk spilling over into trade, diplomacy, and diaspora perception. For leaders, it is in the best interest to view this as a moment for calibration and not confrontation. Avoid taking public stances that directly criticize India's actions or the Modi government's foreign policy. Such comments risk alienating large segments of the Indian American community, many of whom view India's energy and diplomatic independence as a point of national pride. Equally, refrain from overtly endorsing India's oil trade with Russia, which may be seen as undermining US national security interests or contradicting American foreign policy consensus. When pressed on the Russia Sanctions Act or related legislation, avoid taking sides unless absolutely necessary. In the rare instance where a statement is unavoidable, root messaging in widely acceptable values- support for ending the war through diplomacy, reducing global inflationary pressure, and preserving the US-India strategic partnership. In a divisive geopolitical moment like this, it is vital to exercise caution while addressing critical issues like oil supply, which have the potential to snowball into larger repercussions for the bilateral relationship.",
        "questions_from_community": [
          "Do you support the proposed Russia Sanctions Act that could penalize India for importing Russian oil?",
          "Should the US hold its strategic partners to the same standards as its adversaries?"
        ]
      },
      {
        "_id": "66",
        "section": "What's happening in India?",
        "title": "US-based software services company Cognizant to invest $183 million for new India campus, add 8,000 jobs",
        "tag": "Technology, Economy, Jobs, Immigration",
        "context": "US-based IT giant, Cognizant Technology Solutions, announced it will invest approximately US $183 million to build a new campus in India's Visakhapatnam. [15, 18, 19, 20, 29] The planned 22-acre facility will be developed in phases, creating 8,000 new jobs focused on artificial intelligence (AI), digital transformation, and advanced services with full operations expected by early 2029. [15, 18, 19, 20, 29] India has a critical role in supporting America's technological infrastructure. In financial year 2022-23, India's IT and business process management (BPM) sector earned $193 billion in export revenue, with $106 billion of that coming from the United States. In 2023, the US accounted for 62 percent of India's IT-BPS exports, making it the largest single destination for Indian software services. Cost efficiency drives offshoring of jobs to India. While software developer rates range from $18 to $40 per hour in India, by contrast, North American developers cost $95 to $170 per hour on average. This difference, which increases for senior roles, enables US firms to achieve up to 60 percent cost savings on labor when moving development tasks offshore, without sacrificing quality. The H-1B program, aimed at addressing skilled labor shortages, allows immigrants to work in the United States, and is now increasingly being misused. In the financial year 2022-2023, Indian nationals received 72.3 percent of all approved H-1B visas making them the dominant group under this category. In 2022, the top 30 H-1B employers, responsible for 40 percent of all new H-1B hires, collectively laid off at least 85,000 workers while continuing to import foreign labor. At least 13 of these firms were outsourcing companies that underpay H-1B workers and funnel jobs offshore to lower-cost markets. Laid-off H-1B workers, meanwhile, face a 60-day deadline to secure new sponsorship or risk deportation. A striking 66 percent of U.S. companies outsource at least one department, which translates to approximately 300,000 American jobs being outsourced annually. This highlights the dissonance between the economic benefits of offshoring jobs and the loss of American jobs.",
        "exalt_take": "Cognizant's $183 million investment in India highlights how central India is to the US tech strategy. But it also raises critical questions around the US job market, immigration policy, and the role of offshoring. For public officials, this is an urgent conversation that needs to be dealt with sensitively. The H-1B program has long served as a bridge for high-skilled immigrants, especially Indian Americans, to realize their American dream and eventually settle as citizens. But its misuse by offshoring-heavy firms has triggered real concerns- job displacement, wage suppression, and loopholes that bypass American workers. For Democrats, many of whom represent immigrant-rich constituencies, support bipartisan legislation like the H-1B and L-1 Visa Reform Act that aims to fill gaps misused by outsourcing firms while protecting legitimate immigrant workers. Host listening sessions or town halls in immigrant-dense districts to garner feedback from Indian American diaspora members directly affected by job displacement or visa uncertainty. Use social media and public remarks to emphasize that worker protections and immigrant dignity are not mutually exclusive. For Republicans, call for more stringent requirements for firms with heavy offshore staffing models, emphasizing commitment to building domestic talent pipelines rather than relying heavily on offshore growth.",
        "questions_from_community": [
          "Does offshoring tech jobs to India reduce opportunities for immigrants to move to the US through work visas?",
          "Is the H-1B program still a reliable pathway to permanent residency and citizenship?",
          "How can H-1B workers who get laid off or exploited by staffing agencies?",
          "Do you agree that layoffs and offshoring trends make it harder for Indian students on F-1 visas to transition into work?"
        ]
      },
      {
        "_id": "67",
        "section": "What's happening in India?",
        "title": "Indian attends Shanghai Cooperation Organisation defense ministers' meeting in China",
        "tag": "Geopolitics, Defense, Diplomacy",
        "context": "Indian Defense Minister Rajnath Singh attended the Shanghai Cooperation Organisation's (SCO) defense ministers' meeting in Qingdao making headlines for refusing to sign a joint statement citing lack of regional consensus on terrorism, reaffirming defense ties with Russia and seeking a long-term solution for the border standoff with China. [4, 7, 11, 24, 39] While India remains ambivalent owing to its non-alignment foreign policy strategy, China and Russia see SCO as an alternative to the US-led international order, NATO. [39] Current SCO members include India, China, Russia, Pakistan, Kazakhstan, Kyrgyzstan, Tajikistan, Uzbekistan, Iran, and Belarus. [4, 7, 24, 39] India reasserted its stance on terrorism and autonomy over Kashmir by refusing to sign a joint statement after it failed to include its concerns over the Pahalgam militant attack in April. [11, 39] Following Modi's strong statement against Pakistan's state-sponsored terrorism at the G7 summit, Kashmir remains a diplomatic tightrope for the US, which maintains security and counterterrorism ties with both India and Pakistan. India and Russia reaffirmed their defense ties as the latter confirmed the delivery of S-400 Triumf surface-to-air missile systems part of a $5.43 billion deal signed in 2018 by 2026-27. The talks also covered the upgradation of modernisation of India's fleet of approximately 260 Russian-origin Su-30 MKI fighter jets. While India has steadily expanded its defense cooperation with the United States and reduced dependence on Russia, Russia remains its largest arms supplier. For the US, this is an opportunity to tread India away from Russian military systems, particularly since India is a pivotal partner in maintaining stability across the Indo-Pacific. Despite US partnership with Pakistan, Pakistan's deepening military and economic ties with China only reinforce the need for closer US-India alignment in a region shaped by three nuclear-armed countries in an uneasy proximity. India engaged with China during the defense ministers' meeting to push for a lasting solution to their border conflict along the Himalayan border. After a history of border dispute and the 2020 clash with China, the two countries in 2024, announced a gradual pull back of troops to end their military standoff. India's pursuit of de-escalation with China also aligns with US interests in maintaining stability in the Indo-Pacific, while keeping strategic competition with China from escalating into open conflict.",
        "exalt_take": "Key takeaways from the Shanghai Cooperation Organisation (SCO) summit are: a clear assertion of India's firm stance on terrorism, pragmatism with Russia, and openness to de-escalation with China. For US public officials this reaffirms India's critical position as an ally in a volatile strategic neighborhood. India leveraged the forum to protect national interests around Kashmir, sustaining its defense readiness through Russian partnership, and reducing the risk of an open conflict with China. India's presence at multilateral platforms is a source of nationalistic pride for the diaspora who also widely favor the Modi government's foreign policy. This presents a great opportunity to voice support for India's strategic autonomy over Kashmir and re-affirming defense ties while recognizing a strong overall partnership. For Democrats: Publicly acknowledge India's principled stand on cross-border terrorism in Kashmir while reaffirming the need for restraint in South Asia. Continue pushing for flexibility under Countering America's Adversaries Through Sanctions Act (CAATSA) recognizing India's role as a strategic partner in the Indo-Pacific. For Republicans: Frame India as a key partner against authoritarian influence within China-leaning multilateral bodies like the SCO. Promote legislation that incentivizes Indo-US defense co-production as a pathway to reduce Indian reliance on Russian arms.",
        "questions_from_community": [
          "Do you support India's stance on terrorism and its call for full sovereignty and autonomy over the Kashmir issue?",
          "Do you agree with India's continued non-alignment strategy on procurement of Russian arms, oil?",
          "Do you support a CAATSA waiver for India to preserve strategic alignment despite its ties with Russia?",
          "Do you believe India's push for peaceful resolution with China strengthens US regional stability goals in the Indo-Pacific?",
          "Do you agree that India deserves a central role in shaping Indo-Pacific security, even as it engages multilaterally with adversaries of the US?"
        ]
      }
    ]
  }  }
}
